-- Добавление значений в таблицу подкатегорий
insert subcategories
    (id, sub_name)
values
    (1,'Диваны'),
    (2,'Шкафы'),
    (3,'Тумбы'),
    (4,'Пуфы'),
    (5,'Мягкие кресла');

-- Добавление значений в таблицу категорий
insert categories
    (id,category_name, subcategory_id,  parent_id)
values
    (1,'Кухня'        ,null,null),
    (2,'Спальня'      ,null,null),
    (3,'Гостиная'     ,null,null),
    (4,'Прихожая'     ,null,null),
    (5,'Детская'      ,null,null),
    (6,'Мягкая мебель',null,null),

    -- Кухня
    (7,'Кухонные гарнитуры',null,1),
    (8,'Обеденные группы'  ,null,1),
    (9,'Столы'             ,null,1),

    -- Спальня
    (10,null,2,2), -- Шкафы
    (11,'Кровати',null,2),
    (12,'Матрасы',null,2),
    (13,null,4,2), -- Пуфы
    (14,null,3,2), -- Тумбы

    -- Гостиная 3
    (15,null,1,3), -- Диваны
    (16,'Стулья',          null,3),
    (17,'Журнальные столы',null,3),
    (18,null,2,3), -- Шкафы
    (19,null,5,3), -- Мягкие кресла

    -- Прихожая 4
    (20,null,2,4),-- Шкафы
    (21,'Зеркала',null,4),
    (22,null,3,4), -- Тумбы
    (23,'Готовые прихожие',null,4),

    -- Детские 5
    (24,'Детские диваны' ,null,5),
    (25,'Детские кровати',null,5),
    (26,'Детские матрасы',null,5),
    (27,'Детские тумбы'  ,null,5),

    -- Мягкая мебель 6
    (28,null,1,6), -- Диваны
    (29,null,4,6), -- Пуфы
    (30,'Кресла-кровати', null,6),
    (31,null,5,3); -- Мягкие кресла

-- Добавление записей в таблицу производителей
insert producers
(producer_name)
values
    ('ВВР'),
    ('Sheffilton'),
    ('Престиж'),
    ('М-стиль'),
    ('BTS'),
    ('CВ-мебель'),
    ('Империал'),
    ('Олмеко'),
    ('Горизонт'),
    ('Интерьер');

-- Добавление записей в таблицу базовых товаров
insert products
(product_name, description, category_id, producer_id, is_available, show_product)
values
    -- true-1; false-0

    -- Диваны
    ('Диван Гранд велюр','Прямой стильный диван Гранд – прекрасный выбор для вашей гостиной!',  9,1,1,1),
    ('Диван «Токио 2»','Узкие прямые бока и динамичные очертания этого дивана идеально подойдут
        к молодёжному интерьеру гостиной.',                                                          9,2,1,1),
    ('Диван «Остин»','Диван «Остин» оснащён механизмом «Тик так».',                                  9,2,1,1),
    ('Диван «Камелот 2»','Удобный и эргономичный диван «Камелот 2» оснащён механизмом «Еврокнижка»',28,2,1,1),
    ('Соната диван-кровать','Диван в классическом стиле',                                           28,3,1,1),

    -- Кухонные гарнитуры
    ('Кухня 2,0м BTS Люкс модульная','Корпус: ЛДСП. Фасад: МДФ',7,1,1,1),
    ('Кухонный гарнитур Сокол ПН-04 ','Маленький прямой кухонный гарнитур имеет в своем составе необходимые модули',7,1,0,1),
    ('Кухня 2,0м BTS Тифани','Кухня “Тиффани” – воплощение элегантной грации.',7,1,1,1),
    ('Кухня 2,0м BTS Скарлетт','Кухня “Скарлетт” – вкусный коктейль бодрящей зелени!',7,1,1,0),
    ('Кухня BTS Персик 1,8м','Атмосфера южного тепла проникает на кухню вместе с готовым решением «Персик»',7,1,1,1),

    -- Обеденные группы
    ('Обеденная группа Sheffilton SHT-DS233','Для совместных трапез – готовый обеденный комплект с удобными стульями.'      ,8,9,1,1),
    ('Стол со стульями Sheffilton SHT-DS81','Можно выбрать другие цвета стульев и стола.'                                   ,8,9,1,1),
    ('Обеденная группа Sheffilton SHT-DS236','Для совместных трапез – готовый обеденный комплект с удобными стульями.'      ,8,9,1,1),
    ('Набор мебели для кухни Leset Говард 1Р+Чейз','Для совместных трапез – готовый обеденный комплект с удобными стульями.',8,1,1,1),
    ('Комплект изделий Шведский Стандарт','Для совместных трапез – готовый обеденный комплект с удобными стульями.'         ,8,1,1,1),

    -- Столы
    ('Стол RB Круглый','Обеденный стол на фигурной ноге.'                                                       ,9,1 ,1,1),
    ('Стол обеденный RB Орфей-1','Раздвижной стол на двух ногах.'                                               ,9,1 ,1,1),
    ('Стол Катрин Ломберный раскладной','Стол Ломберный раскладной 600х600'                                     ,9,1 ,0,1),
    ('Стол Столлайн Анри','Обеденный стол'                                                                      ,9,6 ,1,1),
    ('Стол обеденный «Брик» Чёрный','комплектуется каркасом из металлических труб с толщиной стенок 2,5 мм'     ,9,2 ,0,1),
    ('Стол обеденный «СО 3» Белый','раздвижной стол, который имеет компактные размеры в сложенном виде'         ,9,2 ,0,1),
    ('Стол обеденный «Ультра»','Комплектуется каркасом из металлических труб покрытых чёрной порошковой краской',9,2 ,0,1),

    -- Шкафы
    ('Модульная гостиная «Токио»','Модульная гостиная «Токио» состоит из стильных и функциональных модулей',                     18,10 ,1,1),-- Гостинная
    ('Шкаф четырёхстворчатый «Милан» Белый','Долговечный диван',                                                                 18,1 ,1,1), -- Гостинная
    ('Гостиная «МГС 5»','Гостиная «МГС 5» представлена в оттенке светлого цемента с белыми ',                                    18,1 ,1,1), -- Гостинная
    ('Шкаф-купе корпус 1,5м "Лотос/Орфей"','Шкаф многофункциональный распашной со створками с зеркалом',                         10,1 ,1,1), -- Спальная
    ('Шкаф-купе Лотос-1 1,7м','Лотос -1 - классический вариант шкафа - купе, который подойдет для гостиной, спальни и прихожей.',10,1 ,1,1), -- Спальная

    -- Кровати
    ('Диван-кровать №1 Дуб Ясень Анкор','Кровать комплектуется двумя выдвижными ящиками',11,2 ,1,1),
    ('ДМ-09 Кровать «Вега» 0,8 м','Кровать комплектуется основанием под матрас из ЛДСП.',11,2 ,1,1),
    ('Кровать двуспальная 1,6 м «Токио»','Класс эмиссии ЛДСП Е1.Материал ЛДСП',11,2 ,1,1),
    ('Кровать-диван с ящиками 0.9*2м «Грей» с фотопечатью','Кровать комплектуется двумя выдвижными ящиками',11,2 ,1,1),
    ('Кровать 1.8 м КР-101 «Александрия»','Срок службы 15 лет. Цвет. Сосна Санторини светлый',11,2 ,1,1),
    -- Кресла-кровати
    ('Кресло-кровать Salotti Альфа','Отличная воздухопроницаемость сохраняет высокие характеристики изделия',30,6 ,1,1),
    ('Кресло-кровать Лига Диванов Сенатор 60','Гипоаллергенность и экологичность Комбинация таких слоев для дивана отличается гипоаллергенностью',30,6 ,1,1),

    -- Матрасы
    ('Матрас Comforto',' средней жесткости на основе пружинного блока TFK',                                          12, 2 ,1,1),
    ('Матрас Comfo холло микс','жёсткий матрас с разной комплектацией сторон на основе блока независимых пружин TFK',12, 2 ,1,1),
    ('Матрас Norma',' классический двухсторонний матрас средней жёсткости на основе пружинного блока Bonnel',        12, 2 ,1,1),
    ('Матрас Comfo сезон','средней жёсткости с разной комплектацией сторон на основе блока независимых пружин TFK',  12, 2 ,1,1),
    ('Матрас Extra микс','матрас с разной жёсткостью сторон на основе чередующихся слоев пены Elafoam',              12, 2 ,1,1),

    -- Пуфы
    ('Пуф «Квадратик» Венге','идеально впишется в интерьер любой комнаты',29,2 ,1,1),
    ('Пуф «Груша»','Можно использовать как снаружи, так и внутри помещений',29,2 ,1,1),
    ('Пуф STOOL GROUP Шарлотта с ящиком','аконичная модель пуфа в обивке из мягкого велюра',29,2 ,1,1),
    ('Пуфик Betel КЛАССИК','зготовлен из такого высококачественного материала как Искусственная кожа',13,5 ,1,1),
    ('Пуф Столлайн ШАРЛЬ круглый','Нагрузка – 120 кг',13,5 ,1,1),

    -- Тумбы
    ('Прикроватная тумба Наоми МН-021-02 Дуб Ниагара (Р)','У тумбы имеется 2 ящика',14,4 ,1,1),
    ('Тумба прикроватная Слайн-К Арго','удобная и красивая модель, которая оборудована тремя вместительными ящиками',14,4 ,1,1),
    ('Тумба Шведский Стандарт Мальта','Универсальная тумба',14,4 ,1,1),
    ('Тумба выкатная с 4-мя ящиками МДК ТБ4','Тумба имеет колёсики',22,2 ,1,1),
    ('Тумба Шведский Стандарт Кастор (4 ящика)',null,22,2 ,1,1),
    ('Тумба BTS Тео','Идеальное решение для каждого',22,1 ,1,1),

    -- Готовые прихожие
    ('Прихожая Ксения-2','Вместительная и лаконичная модель',23,1 ,1,1),
    ('Прихожая Лига','Идеальный выбор для небольшого пространства',23,1 ,1,1),
    ('Прихожая Лира NEW','Это не только практичное, но и красивое решение вопроса хранения вещей',23,1 ,1,1),
    ('Прихожая Трамп','Идеальный выбор для современного интерьера',23,1 ,0,1),
    ('Прихожая Сити лоредо','Очень компактная модель прихожей',23,1 ,1,1);

-- Добавление записей в таблицу атрибутов
insert products_attributes
(attr_name)
values
    -- Общие для всех категорий
    ('Высота'),
    ('Ширина'),
    ('Глубина'),
    ('Высота сидения'),
    ('Вес'),
    ('Материал'),
    ('Стиль'),
    ('Тип'),
    ('Размерность'),
    ('Срок службы'),
    ('Цвет'),
    ('Гарантия'),
    ('Страна-производитель'),
    ('Назначение'),
    ('Ценовой диапазон'),
    ('Особенности'),

    -- Более специфичные
    ('Механизм трансформации'),
    ('Материал каркаса'),
    ('Материал столешницы'),
    ('Материал основания'),
    ('Материал корпуса'),
    ('Материал фасада'),
    ('Материал основания под матрас'),
    ('Ширина в разложенном состоянии (мм.)'),
    ('Форма'),
    ('Количество персон'),
    ('Наполнение'),
    ('Размер спального места'),
    ('Материал обивки'),
    ('Тип направляющих'),
    ('Материал ручек'),
    ('Тип установки'),
    ('Нагрузка'),
    ('Наличие матраса'),
    ('Высота изножья'),
    ('Тип ткани'),
    ('Жесткость'),
    ('Тип пружинного блока'),
    ('Количество пружин на м²'),
    ('Высота изголовья');

-- Добавление записей в таблицу атрибутов по категориям
insert attributes_categories
(attribute_id, category_id)
values
    -- Кухонные гарнитуры
    (1 , 7), -- Высота
    (2 , 7), -- Ширина
    (3 , 7), -- Глубина
    (4 , 7), -- Вес
    (5 , 7), -- Материалы
    (6 , 7), -- Стиль
    (7 , 7), -- Тип
    (8 , 7), -- Размерность
    (9 , 7), -- Срок службы
    (11, 7),-- Гарантия
    (12, 7),-- Страна-производитель
    (14, 7),-- Ценовой диапазон
    (15, 7),-- Особенности
    (18, 7),-- Материал столешницы
    (19, 7),-- Материал основания
    (21, 7),-- Материал фасада
    (30, 7),-- Тип направляющих
    (31, 7),-- Материал ручек

    -- Обеденные группы
    (1 , 8), -- Высота
    (2 , 8), -- Ширина
    (3 , 8), -- Глубина
    (4 , 8), -- Вес
    (5 , 8), -- Материалы
    (6 , 8), -- Стиль
    (7 , 8), -- Тип
    (8 , 8), -- Размерность
    (9 , 8), -- Срок службы
    (11, 8),-- Гарантия
    (12, 8),-- Страна-производитель
    (13, 8),-- Назначение
    (14, 8),-- Ценовой диапазон
    (15, 8),-- Особенности
    (18, 8),-- Материал столешницы
    (19, 8),-- Материал основания
    (24, 8),-- Форма
    (25, 8),-- Количество персон

    -- Столы
    (1 , 9), -- Высота
    (2 , 9), -- Ширина
    (3 , 9), -- Глубина
    (4 , 9), -- Вес
    (5 , 9), -- Материалы
    (6 , 9), -- Стиль
    (7 , 9), -- Тип
    (8 , 9), -- Размерность
    (9 , 9), -- Срок службы
    (11, 9),-- Гарантия
    (12, 9),-- Страна-производитель
    (13, 9),-- Назначение
    (14, 9),-- Ценовой диапазон
    (15, 9),-- Особенности
    (18, 9),-- Материал столешницы
    (19, 9),-- Материал основания
    (24, 9),-- Форма

    -- Шкафы
    (1 , 10), -- Высота
    (2 , 10), -- Ширина
    (3 , 10), -- Глубина
    (4 , 10), -- Вес
    (5 , 10), -- Материалы
    (6 , 10), -- Стиль
    (7 , 10), -- Тип
    (8 , 10), -- Размерность
    (9 , 10), -- Срок службы
    (11, 10),-- Гарантия
    (12, 10),-- Страна-производитель
    (13, 10),-- Назначение
    (14, 10),-- Ценовой диапазон
    (15, 10),-- Особенности
    (24, 10),-- Форма
    (32, 10),-- Тип установки

    -- Кровати
    (1 , 11), -- Высота
    (2 , 11), -- Ширина
    (3 , 11), -- Глубина
    (4 , 11), -- Вес
    (5 , 11), -- Материалы
    (6 , 11), -- Стиль
    (7 , 11), -- Тип
    (8 , 11), -- Размерность
    (9 , 11), -- Срок службы
    (11, 11),-- Гарантия
    (12, 11),-- Страна-производитель
    (13, 11),-- Назначение
    (14, 11),-- Ценовой диапазон
    (15, 11),-- Особенности
    (20, 11),-- Материал корпуса
    (22, 11),-- Материал основания под матрас
    (24, 11),-- Форма
    (27, 11),-- Размер спального места
    (28, 11),-- Материал обивки
    (29, 11),-- Высота изголовья
    (35, 11),-- Наличие матраса
    (36, 11),-- Высота изножья

    -- Матрасы
    (1 , 12), -- Высота
    (2 , 12), -- Ширина
    (3 , 12), -- Глубина
    (12, 12),-- Страна-производитель
    (14, 12),-- Ценовой диапазон
    (15, 12),-- Особенности
    (26, 12),-- Наполнение
    (27, 12),-- Размер спального места
    (33, 12),-- Нагрузка
    (38, 12),-- Жесткость
    (39, 12),-- Тип пружинного блока
    (40, 12),-- Количество пружин на м²

    -- Пуфы
    (1 , 13), -- Высота
    (2 , 13), -- Ширина
    (3 , 13), -- Глубина
    (5 , 13), -- Материалы
    (6 , 13), -- Стиль
    (7 , 13), -- Тип
    (8 , 13), -- Размерность
    (9 , 13), -- Срок службы
    (11, 13),-- Гарантия
    (12, 13),-- Страна-производитель
    (13, 13),-- Назначение
    (14, 13),-- Ценовой диапазон
    (15, 13),-- Особенности
    (24, 13),-- Форма

    -- Тумбы
    (1 , 14), -- Высота
    (2 , 14), -- Ширина
    (3 , 14), -- Глубина
    (4 , 14), -- Вес
    (5 , 14), -- Материалы
    (6 , 14), -- Стиль
    (7 , 14), -- Тип
    (8 , 14), -- Размерность
    (9 , 14), -- Срок службы
    (11, 14),-- Гарантия
    (12, 14),-- Страна-производитель
    (13, 14),-- Назначение
    (14, 14),-- Ценовой диапазон
    (15, 14),-- Особенности

    -- Диваны
    (1 , 15), -- Высота
    (2 , 15), -- Ширина
    (3 , 15), -- Глубина
    (4 , 15), -- Вес
    (5 , 15), -- Материалы
    (6 , 15), -- Стиль
    (7 , 15), -- Тип
    (8 , 15), -- Размерность
    (9 , 15), -- Срок службы
    (11, 15),-- Гарантия
    (12, 15),-- Страна-производитель
    (13, 15),-- Назначение
    (14, 15),-- Ценовой диапазон
    (15, 15),-- Особенности
    (16, 15),-- Механизм трансформации
    (17, 15),-- Материал каркаса
    (24, 15),-- Форма
    (26, 15),-- Наполнение

    -- Стулья
    (1 , 16), -- Высота
    (2 , 16), -- Ширина
    (3 , 16), -- Глубина
    (5 , 16), -- Материалы
    (6 , 16), -- Стиль
    (7 , 16), -- Тип
    (8 , 16), -- Размерность
    (9 , 16), -- Срок службы
    (11, 16),-- Гарантия
    (12, 16),-- Страна-производитель
    (13, 16),-- Назначение
    (14, 16),-- Ценовой диапазон
    (15, 16),-- Особенности
    (24, 16),-- Форма
    (33, 16),-- Нагрузка
    (34, 16),-- Высота сидения

    -- Журнальные столы
    (1 , 17), -- Высота
    (2 , 17), -- Ширина
    (3 , 17), -- Глубина
    (4 , 17), -- Вес
    (5 , 17), -- Материалы
    (6 , 17), -- Стиль
    (7 , 17), -- Тип
    (8 , 17), -- Размерность
    (9 , 17), -- Срок службы
    (11, 17),-- Гарантия
    (12, 17),-- Страна-производитель
    (13, 17),-- Назначение
    (14, 17),-- Ценовой диапазон
    (15, 17),-- Особенности
    (18, 17),-- Материал столешницы
    (19, 17),-- Материал основания
    (24, 17),-- Форма
    (25, 17),-- Количество персон

    -- Мягкие кресла
    (1 , 19), -- Высота
    (2 , 19), -- Ширина
    (3 , 19), -- Глубина
    (4 , 19), -- Вес
    (5 , 19), -- Материалы
    (6 , 19), -- Стиль
    (7 , 19), -- Тип
    (8 , 19), -- Размерность
    (9 , 19), -- Срок службы
    (11, 19),-- Гарантия
    (12, 19),-- Страна-производитель
    (13, 19),-- Назначение
    (14, 19),-- Ценовой диапазон
    (15, 19),-- Особенности
    (17, 19),-- Материал каркаса
    (24, 19),-- Форма
    (26, 19),-- Наполнение
    (34, 19),-- Высота сидения

    -- Зеркала
    (1 , 21), -- Высота
    (2 , 21), -- Ширина
    (3 , 21), -- Глубина
    (4 , 21), -- Вес
    (5 , 21), -- Материалы
    (6 , 21), -- Стиль
    (7 , 21), -- Тип
    (8 , 21), -- Размерность
    (9 , 21), -- Срок службы
    (11, 21),-- Гарантия
    (12, 21),-- Страна-производитель
    (13, 21),-- Назначение
    (14, 21),-- Ценовой диапазон
    (15, 21),-- Особенности
    (24, 21),-- Форма
    (32, 21),-- Тип установки

    -- Готовые прихожие
    (1 , 23), -- Высота
    (2 , 23), -- Ширина
    (3 , 23), -- Глубина
    (4 , 23), -- Вес
    (5 , 23), -- Материалы
    (6 , 23), -- Стиль
    (7 , 23), -- Тип
    (8 , 23), -- Размерность
    (9 , 23), -- Срок службы
    (11, 23),-- Гарантия
    (12, 23),-- Страна-производитель
    (13, 23),-- Назначение
    (14, 23),-- Ценовой диапазон
    (15, 23),-- Особенности
    (30, 23),-- Тип направляющих
    (31, 23),-- Материал ручек

    -- Детские диваны
    (1 , 24), -- Высота
    (2 , 24), -- Ширина
    (3 , 24), -- Глубина
    (4 , 24), -- Вес
    (5 , 24), -- Материалы
    (6 , 24), -- Стиль
    (7 , 24), -- Тип
    (8 , 24), -- Размерность
    (9 , 24), -- Срок службы
    (11, 24),-- Гарантия
    (12, 24),-- Страна-производитель
    (13, 24),-- Назначение
    (14, 24),-- Ценовой диапазон
    (15, 24),-- Особенности
    (16, 24),-- Механизм трансформации
    (17, 24),-- Материал каркаса
    (24, 24),-- Форма
    (26, 24),-- Наполнение

    -- Детские кровати
    (1 , 25), -- Высота
    (2 , 25), -- Ширина
    (3 , 25), -- Глубина
    (4 , 25), -- Вес
    (5 , 25), -- Материалы
    (6 , 25), -- Стиль
    (7 , 25), -- Тип
    (8 , 25), -- Размерность
    (9 , 25), -- Срок службы
    (11, 25),-- Гарантия
    (12, 25),-- Страна-производитель
    (13, 25),-- Назначение
    (14, 25),-- Ценовой диапазон
    (15, 25),-- Особенности
    (20, 25),-- Материал корпуса
    (22, 25),-- Материал основания под матрас
    (24, 25),-- Форма
    (27, 25),-- Размер спального места
    (28, 25),-- Материал обивки
    (29, 25),-- Высота изголовья
    (35, 25),-- Наличие матраса
    (36, 25),-- Высота изножья

    -- Детские матрасы
    (1 , 26), -- Высота
    (2 , 26), -- Ширина
    (3 , 26), -- Глубина
    (12, 26),-- Страна-производитель
    (14, 26),-- Ценовой диапазон
    (15, 26),-- Особенности
    (26, 26),-- Наполнение
    (27, 26),-- Размер спального места
    (33, 26),-- Нагрузка
    (37, 26),-- Тип ткани
    (38, 26),-- Жесткость

    -- Детские тумбы
    (1 , 27), -- Высота
    (2 , 27), -- Ширина
    (3 , 27), -- Глубина
    (4 , 27), -- Вес
    (5 , 27), -- Материалы
    (6 , 27), -- Стиль
    (7 , 27), -- Тип
    (8 , 27), -- Размерность
    (9 , 27), -- Срок службы
    (11, 27),-- Гарантия
    (12, 27),-- Страна-производитель
    (13, 27),-- Назначение
    (14, 27),-- Ценовой диапазон
    (15, 27),-- Особенности

    -- Кресла-кровати
    (1 , 30), -- Высота
    (2 , 30), -- Ширина
    (3 , 30), -- Глубина
    (4 , 30), -- Вес
    (5 , 30), -- Материалы
    (6 , 30), -- Стиль
    (7 , 30), -- Тип
    (8 , 30), -- Размерность
    (9 , 30), -- Срок службы
    (11, 30),-- Гарантия
    (12, 30),-- Страна-производитель
    (13, 30),-- Назначение
    (14, 30),-- Ценовой диапазон
    (15, 30),-- Особенности
    (16, 30),-- Механизм трансформации
    (17, 30),-- Материал каркаса
    (24, 30),-- Форма
    (26, 30);-- Наполнение

-- Добавление значений атрибутов
insert attributes_values
(product_id, attribute_id,  txt_values, int_value, float_value, double_value, bool_value, date_value)
values
    -- Диваны

    (1, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (1, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (1, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (1, 4,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Вес
    (1, 5,  'Велюр', null, null, null, null, null), -- Материалы
    (1, 6,  'Современный', null, null, null, null, null), -- Стиль
    (1, 7,  'Раскладной', null, null, null, null, null), -- Тип
    (1, 8,  null, null, null, null, null, null), -- Размерность
    (1, 9,  null, null, null, null, null, null), -- Срок службы
    (1, 11, '12 мес.', null, null, null, null, null), -- Гарантия
    (1, 12, 'Россия', null, null, null, null, null), -- Страна-производитель
    (1, 13, 'Для спальни', null, null, null, null, null), -- Назначение
    (1, 14, 'Дорогие', null, null, null, null, null), -- Ценовой диапазон
    (1, 15, 'С подлокотниками', null, null, null, null, null), -- Особенности
    (1, 15, 'Со спальным местом', null, null, null, null, null), -- Особенности
    (1, 15, 'С подушками', null, null, null, null, null), -- Особенности
    (1, 16, 'Аккордеон', null, null, null, null, null), -- Механизм трансформации
    (1, 17, 'Дерево', null, null, null, null, null), -- Материал каркаса
    (1, 24, 'Классическая', null, null, null, null, null), -- Форма
    (1, 26, 'ППУ', null, null, null, null, null), -- Наполнение

    -- Диван «Токио 2»
    (2, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (2, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (2, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (2, 4,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Вес
    (2, 5,  'Велюр', null, null, null, null, null), -- Материалы
    (2, 6,  'Современный', null, null, null, null, null), -- Стиль
    (2, 7,  'Раскладной', null, null, null, null, null), -- Тип
    (2, 8,  null, null, null, null, null, null), -- Размерность
    (2, 9,  null, null, null, null, null, null), -- Срок службы
    (2, 11, '12 мес.', null, null, null, null, null), -- Гарантия
    (2, 12, 'Россия', null, null, null, null, null), -- Страна-производитель
    (2, 13, 'Для спальни', null, null, null, null, null), -- Назначение
    (2, 14, 'Дорогие', null, null, null, null, null), -- Ценовой диапазон
    (2, 15, 'С подлокотниками', null, null, null, null, null), -- Особенности
    (2, 15, 'Со спальным местом', null, null, null, null, null), -- Особенности
    (2, 16, 'Аккордеон', null, null, null, null, null), -- Механизм трансформации
    (2, 17, 'Металлокаркас', null, null, null, null, null), -- Материал каркаса
    (2, 24, 'Классическая', null, null, null, null, null), -- Форма
    (2, 26, 'ППУ', null, null, null, null, null), -- Наполнение

    -- Диван «Остин»
    (3, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (3, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (3, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (3, 4,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Вес
    (3, 5,  'Кожа', null, null, null, null, null), -- Материалы
    (3, 6,  'Современный', null, null, null, null, null), -- Стиль
    (3, 7,  'Раскладной', null, null, null, null, null), -- Тип
    (3, 8,  null, null, null, null, null, null), -- Размерность
    (3, 9,  null, null, null, null, null, null), -- Срок службы
    (3, 11, '12 мес.', null, null, null, null, null), -- Гарантия
    (3, 12, 'Россия', null, null, null, null, null), -- Страна-производитель
    (3, 13, 'Для спальни', null, null, null, null, null), -- Назначение
    (3, 14, 'Дорогие', null, null, null, null, null), -- Ценовой диапазон
    (3, 15, 'С подлокотниками', null, null, null, null, null), -- Особенности
    (3, 15, 'Со спальным местом', null, null, null, null, null), -- Особенности
    (3, 16, 'Тик-так. Еврокнижка', null, null, null, null, null), -- Механизм трансформации
    (3, 17, 'Металлокаркас', null, null, null, null, null), -- Материал каркаса
    (3, 24, 'Классическая', null, null, null, null, null), -- Форма
    (3, 26, 'ППУ', null, null, null, null, null), -- Наполнение

    -- Диван «Камелот 2»
    (4, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (4, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (4, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (4, 4,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Вес
    (4, 5,  'Велюр', null, null, null, null, null), -- Материалы
    (4, 6,  'Современный', null, null, null, null, null), -- Стиль
    (4, 7,  'Раскладной', null, null, null, null, null), -- Тип
    (4, 8,  null, null, null, null, null, null), -- Размерность
    (4, 9,  null, null, null, null, null, null), -- Срок службы
    (4, 11, '18 месяцев', null, null, null, null, null), -- Гарантия
    (4, 12, 'Россия', null, null, null, null, null), -- Страна-производитель
    (4, 13, 'Для спальни', null, null, null, null, null), -- Назначение
    (4, 14, 'Дорогие', null, null, null, null, null), -- Ценовой диапазон
    (4, 15, 'Со спальным местом', null, null, null, null, null), -- Особенности
    (4, 16, 'Пантограф', null, null, null, null, null), -- Механизм трансформации
    (4, 17, 'Металл', null, null, null, null, null), -- Материал каркаса
    (4, 24, 'Классическая', null, null, null, null, null), -- Форма
    (4, 26, 'ППУ', null, null, null, null, null), -- Наполнение

    -- Соната диван-кровать
    (5, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (5, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (5, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (5, 4,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Вес
    (5, 5,  'Велюр', null, null, null, null, null), -- Материалы
    (5, 6,  'Современный', null, null, null, null, null), -- Стиль
    (5, 7,  'Прямой', null, null, null, null, null), -- Тип
    (5, 8,  null, null, null, null, null, null), -- Размерность
    (5, 9,  null, null, null, null, null, null), -- Срок службы
    (5, 11, '18 месяцев', null, null, null, null, null), -- Гарантия
    (5, 12, 'Россия', null, null, null, null, null), -- Страна-производитель
    (5, 13, 'Для гостинной', null, null, null, null, null), -- Назначение
    (5, 14, 'Дорогие', null, null, null, null, null), -- Ценовой диапазон
    (5, 15, 'С подлокотниками', null, null, null, null, null), -- Особенности
    (5, 15, 'Спальное место интегрировано', null, null, null, null, null), -- Особенности
    (5, 16, null, null, null, null, null, null), -- Механизм трансформации
    (5, 17, 'Металл', null, null, null, null, null), -- Материал каркаса
    (5, 24, 'Классическая', null, null, null, null, null), -- Форма
    (5, 26, 'ППУ', null, null, null, null, null); -- Наполнение


insert attributes_values
(product_id, attribute_id,  txt_values, int_value)
values
    -- Кухонные гарнитуры

    -- Кухня 2,0м BTS Люкс модульная
    (6, 1,  null, ROUND(RAND()*(760-500)+500,0)), -- Высота
    (6, 2,  null, ROUND(RAND()*(760-500)+500,0)), -- Ширина
    (6, 3,  null, ROUND(RAND()*(760-500)+500,0)), -- Глубина
    (6, 4,  null, ROUND(RAND()*(80-120)+120,0)), -- Вес
    (6, 5,  'ЛДСП', null), -- Материалы
    (6, 5,  'МДФ',  null), -- Материалы
    (6, 6,  null, null), -- Стиль
    (6, 7,  null, null), -- Тип
    (6, 8,  null, null), -- Размерность
    (6, 9,  null, ROUND(RAND()*(7-12)+12,0)), -- Срок службы
    (6, 11, null, null),  -- Гарантия
    (6, 12, null, null), -- Страна-производитель
    (6, 14, 'Средняя', null), -- Ценовой диапазон
    (6, 15, null, null), -- Особенности
    (6, 18, 'Столешница "Антарес"', null), -- Материал столешницы
    (6, 19, null, null), -- Материал основания
    (6, 21, 'МДФ', null), -- Материал фасада
    (6, 30, null, null), -- Тип направляющих
    (6, 31, null, null), -- Материал ручек

    -- Кухонный гарнитур Сокол ПН-04
    (7, 1,  null, ROUND(RAND()*(760-500)+500,0)), -- Высота
    (7, 2,  null, ROUND(RAND()*(760-500)+500,0)), -- Ширина
    (7, 3,  null, ROUND(RAND()*(760-500)+500,0)), -- Глубина
    (7, 4,  null, ROUND(RAND()*(80-120)+120,0) ), -- Вес
    (7, 5,  'ЛДСП', null), -- Материалы
    (7, 6,  null, null  ), -- Стиль
    (7, 7,  null, null  ), -- Тип
    (7, 8,  null, null  ), -- Размерность
    (7, 9,  null, ROUND(RAND()*(7-12)+12,0)), -- Срок службы
    (7, 11, null, null),  -- Гарантия
    (7, 12, null, null), -- Страна-производитель
    (7, 14, 'Средняя', null), -- Ценовой диапазон
    (7, 15, null, null), -- Особенности
    (7, 18, 'ЛДСП', null), -- Материал столешницы
    (7, 19, null,   null), -- Материал основания
    (7, 21, 'МДФ',  null), -- Материал фасада
    (7, 30, null,   null), -- Тип направляющих
    (7, 31, null,   null), -- Материал ручек

    -- Кухня 2,0м BTS Тифани
    (8, 1,  null, ROUND(RAND()*(760-500)+500,0)), -- Высота
    (8, 2,  null, ROUND(RAND()*(760-500)+500,0)), -- Ширина
    (8, 3,  null, ROUND(RAND()*(760-500)+500,0)), -- Глубина
    (8, 4,  null, ROUND(RAND()*(80-120)+120,0)), -- Вес
    (8, 5,  'ЛДСП',null), -- Материалы
    (8, 5,  'МДФ', null), -- Материалы
    (8, 6,  null, null), -- Стиль
    (8, 7,  null, null), -- Тип
    (8, 8,  null, null), -- Размерность
    (8, 9,  null, ROUND(RAND()*(7-12)+12,0)), -- Срок службы
    (8, 11, null, null),  -- Гарантия
    (8, 12, null, null), -- Страна-производитель
    (8, 14, 'Средняя', null), -- Ценовой диапазон
    (8, 15, null, null), -- Особенности
    (8, 18, 'ЛДСП', null), -- Материал столешницы
    (8, 19, null, null), -- Материал основания
    (8, 21, 'МДФ “Блёстки Оранж', null), -- Материал фасада
    (8, 30, null, null), -- Тип направляющих
    (8, 31, null, null), -- Материал ручек

    -- Кухня 2,0м BTS Скарлетт
    (9, 1,  null, ROUND(RAND()*(760-500)+500,0)), -- Высота
    (9, 2,  null, ROUND(RAND()*(760-500)+500,0)), -- Ширина
    (9, 3,  null, ROUND(RAND()*(760-500)+500,0)), -- Глубина
    (9, 4,  null, ROUND(RAND()*(80-120)+120,0) ), -- Вес
    (9, 5,  'ЛДСП', null), -- Материалы
    (9, 6,  null, null), -- Стиль
    (9, 7,  null, null), -- Тип
    (9, 8,  null, null), -- Размерность
    (9, 9,  null, ROUND(RAND()*(7-12)+12,0)), -- Срок службы
    (9, 11, null, null),  -- Гарантия
    (9, 12, null, null), -- Страна-производитель
    (9, 14, 'Низкая', null), -- Ценовой диапазон
    (9, 15, null, null), -- Особенности
    (9, 18, 'ЛДСП', null), -- Материал столешницы
    (9, 19, null, null), -- Материал основания
    (9, 21, 'ЛДСП Белый', null), -- Материал фасада
    (9, 30, null, null), -- Тип направляющих
    (9, 31, null, null), -- Материал ручек

    -- Кухня BTS Персик 1,8м
    (10, 1,  null, ROUND(RAND()*(760-500)+500,0)), -- Высота
    (10, 2,  null, ROUND(RAND()*(760-500)+500,0)), -- Ширина
    (10, 3,  null, ROUND(RAND()*(760-500)+500,0)), -- Глубина
    (10, 4,  null, ROUND(RAND()*(80-120)+120,0)), -- Вес
    (10, 5,  'ЛДСП', null), -- Материалы
    (10, 5,  'МДФ', null ), -- Материалы
    (10, 6,  null, null), -- Стиль
    (10, 7,  null, null), -- Тип
    (10, 8,  null, null), -- Размерность
    (10, 9,  null, ROUND(RAND()*(7-12)+12,0)), -- Срок службы (лет)
    (10, 11, 'Нет', null),  -- Гарантия
    (10, 12, null,  null), -- Страна-производитель
    (10, 14, 'Средняя', null), -- Ценовой диапазон
    (10, 15, null, null), -- Особенности
    (10, 18, 'ЛДСП', null), -- Материал столешницы
    (10, 19, null, null), -- Материал основания
    (10, 21, 'МДФ “Блёстки Оранж”', null), -- Материал фасада
    (10, 30, null, null), -- Тип направляющих
    (10, 31, null, null); -- Материал ручек

insert attributes_values
(product_id, attribute_id, txt_values, int_value, float_value, double_value, bool_value, date_value)
values
    -- Обеденные группы

    -- Обеденная группа Sheffilton SHT-DS233
    (11, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (11, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (11, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (11, 4,  null, ROUND(RAND()*(80-120)+120,0), null, null, null, null),  -- Вес
    (11, 5,  null, null, null, null, null, null), -- Высота
    (11, 6,  null, null, null, null, null, null), -- Ширина
    (11, 7,  null,  null, null, null, null, null),-- Глубина
    (11, 8,  null, null, null, null, null, null), -- Вес
    (11, 9,  null, null, null, null, null, null), -- Материалы
    (11, 11, null, null, null, null, null, null), -- Стиль
    (11, 12, null, null, null, null, null, null), -- Тип
    (11, 13, null, null, null, null, null, null), -- Размерность
    (11, 14, null, ROUND(RAND()*(7-12)+12,0), null, null, null, null), -- Срок службы
    (11, 15, null, null, null, null, null, null), -- Гарантия
    (11, 18, null, null, null, null, null, null), -- Страна-производитель
    (11, 19, null, null, null, null, null, null), -- Назначение
    (11, 24, null, null, null, null, null, null), -- Ценовой диапазон

    -- Стол со стульями Sheffilton SHT-DS81
    (12, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (12, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (12, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (12, 4,  null, ROUND(RAND()*(20-50)+50,0), null, null, null, null),  -- Вес
    (12, 5,  'Металл', null, null, null, null, null),                 -- Материалы
    (12, 5,  'МДФ', null, null, null, null, null),                    -- Материалы
    (12, 6,  'Современный',  null, null, null, null, null),           -- Стиль
    (12, 7,  'Раздвижной', null, null, null, null, null),             -- Тип
    (12, 8,  'Маленькие', null, null, null, null, null),               -- Размерность
    (12, 9,  null, ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (12, 11, null, null, null, null, null, null),                     -- Гарантия
    (12, 12, null, null, null, null, null, null),                     -- Страна-производитель
    (12, 13, 'Для кухни', null, null, null, null, null),              -- Назначение
    (12, 14, 'Дорогие', null, null, null, null, null),                -- Ценовой диапазон
    (12, 15, null, null, null, null, null, null),                     -- Особенности
    (12, 18, 'МДФ', null, null, null, null, null),                    -- Материал столешницы
    (12, 19, 'металл', null, null, null, null, null),                 -- Материал основания
    (12, 24, 'Прямоугольные', null, null, null, null, null),          -- Форма
    (12, 25, null, 4, null, null, null, null),                        -- Количество персон

    -- Обеденная группа Sheffilton SHT-DS236
    (13, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (13, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (13, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (13, 4,  null, ROUND(RAND()*(20-50)+50,0), null, null, null, null),  -- Вес
    (13, 5,  'Металл', null, null, null, null, null),                 -- Материалы
    (13, 5,  'ЛДСП', null, null, null, null, null),                    -- Материалы
    (13, 6,  'Современный',  null, null, null, null, null),           -- Стиль
    (13, 7,  'Раздвижной', null, null, null, null, null),             -- Тип
    (13, 8,  'Маленькие', null, null, null, null, null),                -- Размерность
    (13, 9,  null, ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (13, 11, null, null, null, null, null, null),                     -- Гарантия
    (13, 12, null, null, null, null, null, null),                     -- Страна-производитель
    (13, 13, 'Для кухни', null, null, null, null, null),              -- Назначение
    (13, 14, 'Дорогие', null, null, null, null, null),                -- Ценовой диапазон
    (13, 15, null, null, null, null, null, null),                     -- Особенности
    (13, 18, 'ЛДСП', null, null, null, null, null),                    -- Материал столешницы
    (13, 19, 'металл', null, null, null, null, null),                 -- Материал основания
    (13, 24, 'Прямоугольные', null, null, null, null, null),          -- Форма
    (13, 25, null, 4, null, null, null, null),                        -- Количество персон

    -- Набор мебели для кухни Leset Говард 1Р+Чейз
    (14, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (14, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (14, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (14, 4,  null, ROUND(RAND()*(20-50)+50,0), null, null, null, null),  -- Вес
    (14, 5,  'Дерево', null, null, null, null, null),                 -- Материалы
    (14, 5,  'Шпон', null, null, null, null, null),                    -- Материалы
    (14, 6,  'Современный',  null, null, null, null, null),           -- Стиль
    (14, 7,  'Раздвижной', null, null, null, null, null),             -- Тип
    (14, 8,  'Маленькие', null, null, null, null, null),              -- Размерность
    (14, 9,  null, ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (14, 11, null, null, null, null, null, null),                     -- Гарантия
    (14, 12, null, null, null, null, null, null),                     -- Страна-производитель
    (14, 13, 'Для кухни', null, null, null, null, null),              -- Назначение
    (14, 14, 'Дорогие', null, null, null, null, null),                -- Ценовой диапазон
    (14, 15, null, null, null, null, null, null),                     -- Особенности
    (14, 18, 'Дерево. Шпон', null, null, null, null, null),           -- Материал столешницы
    (14, 19, 'массив', null, null, null, null, null),                 -- Материал основания
    (14, 24, 'Круглый', null, null, null, null, null),                -- Форма
    (14, 25, null, 4, null, null, null, null),                        -- Количество персон

    -- Комплект изделий Шведский Стандарт
    (15, 1,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (15, 2,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (15, 3,  null, ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (15, 4,  null, ROUND(RAND()*(20-50)+50,0), null, null, null, null),  -- Вес
    (15, 5,  'Массив', null, null, null, null, null),                 -- Материалы
    (15, 6,  'Скандинавский (IKEA)',  null, null, null, null, null),  -- Стиль
    (15, 7,  'Раздвижной', null, null, null, null, null),             -- Тип
    (15, 8,  'Маленькие', null, null, null, null, null),              -- Размерность
    (15, 9,  null, ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (15, 11, null, null, null, null, null, null),                     -- Гарантия
    (15, 12, 'Беларусь', null, null, null, null, null),               -- Страна-производитель
    (15, 13, 'Для кухни', null, null, null, null, null),              -- Назначение
    (15, 14, 'Дорогие', null, null, null, null, null),                -- Ценовой диапазон
    (15, 15, null, null, null, null, null, null),                     -- Особенности
    (15, 18, 'массив', null, null, null, null, null),                 -- Материал столешницы
    (15, 19, 'массив', null, null, null, null, null),                 -- Материал основания
    (15, 24, 'Круглый', null, null, null, null, null),                -- Форма
    (15, 25, null, 4, null, null, null, null),                        -- Количество персон

    -- Столы

    -- Стол RB Круглый
    (16, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (16, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (16, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (16, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (16, 5, 'МДФ'  , null, null, null, null, null),                     -- Материалы
    (16, 5, 'шпон'  , null, null, null, null, null),                     -- Материалы
    (16, 6, 'Классический'  ,  null, null, null, null, null),                    -- Стиль
    (16, 7, 'Раздвижной'  , null, null, null, null, null),                     -- Тип
    (16, 8, 'Большие'  , null, null, null, null, null),                     -- Размерность
    (16, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (16, 11,null , null, null, null, null, null),                     -- Гарантия
    (16, 12,'Россия'  , null, null, null, null, null),                     -- Страна-производитель
    (16, 13,'Для кухни'  , null, null, null, null, null),                     -- Назначение
    (16, 14,'Дорогие'  , null, null, null, null, null),                     -- Ценовой диапазон
    (16, 15,'С одной ножкой'  , null, null, null, null, null),              -- Особенности
    (16, 18,'МДФ.Шпон'  , null, null, null, null, null),                     -- Материал столешницы
    (16, 19,'массив'  , null, null, null, null, null),                     -- Материал основания
    (16, 24,'Круглые'  , null, null, null, null, null),                     -- Форма

    -- Стол обеденный RB Орфей-1
    (17, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (17, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (17, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (17, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (17, 5, 'Дерево'   , null, null, null, null, null),                     -- Материалы
    (17, 5, 'МДФ'   , null, null, null, null, null),                     -- Материалы
    (17, 6, 'Классический'   ,  null, null, null, null, null),            -- Стиль
    (17, 7, 'Раздвижной'   , null, null, null, null, null),           -- Тип
    (17, 8, 'Большие.Широкие'   , null, null, null, null, null),      -- Размерность
    (17, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (17, 11,null , null, null, null, null, null),                     -- Гарантия
    (17, 12,'Россия'     , null, null, null, null, null),                     -- Страна-производитель
    (17, 13,'Для кухни'  , null, null, null, null, null),                     -- Назначение
    (17, 14,'Дорогие'    , null, null, null, null, null),                     -- Ценовой диапазон
    (17, 15,'Матовые'    , null, null, null, null, null),                     -- Особенности
    (17, 18,'Дерево.МДФ' , null, null, null, null, null),                  -- Материал столешницы
    (17, 19,'массив'     , null, null, null, null, null),                      -- Материал основания
    (17, 24,'Овальные'   , null, null, null, null, null),                    -- Форма

    -- Стол Катрин Ломберный раскладной
    (18, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (18, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (18, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (18, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (18, 5, 'ЛДСП'   , null, null, null, null, null),                     -- Материалы
    (18, 6, null   ,  null, null, null, null, null),                    -- Стиль
    (18, 7, 'Раскладной'   , null, null, null, null, null),             -- Тип
    (18, 8, 'Маленькие.Широкие'   , null, null, null, null, null),      -- Размерность
    (18, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),  -- Срок службы
    (18, 11,null , null, null, null, null, null),                       -- Гарантия
    (18, 12,'Россия'     , null, null, null, null, null),               -- Страна-производитель
    (18, 13,'Для кухни'  , null, null, null, null, null),               -- Назначение
    (18, 14,'Дорогие'    , null, null, null, null, null),               -- Ценовой диапазон
    (18, 15,'Матовые'    , null, null, null, null, null),               -- Особенности
    (18, 18,'ЛДСП' , null, null, null, null, null),                     -- Материал столешницы
    (18, 19,'массив'     , null, null, null, null, null),               -- Материал основания
    (18, 24,'Прямоугольные. Длинные'   , null, null, null, null, null), -- Форма
    (18, 25, null, 8, null, null, null, null),                          -- Количество персон

    -- Стол Столлайн Анри
    (19, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (19, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (19, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (19, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (19, 5, 'Стекло'   , null, null, null, null, null),                     -- Материалы
    (19, 5, 'металл'   , null, null, null, null, null),                     -- Материалы
    (19, 6, 'Скандинавский (IKEA)'   ,  null, null, null, null, null),      -- Стиль
    (19, 7, 'Нераскладной'   , null, null, null, null, null),               -- Тип
    (19, 8, ''   , null, null, null, null, null),                     -- Размерность
    (19, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (19, 11,null , null, null, null, null, null),                     -- Гарантия
    (19, 12,'Россия'     , null, null, null, null, null),                     -- Страна-производитель
    (19, 13,'Для кухни'  , null, null, null, null, null),                     -- Назначение
    (19, 14,'Дорогие'    , null, null, null, null, null),                     -- Ценовой диапазон
    (19, 15,'Матовые'    , null, null, null, null, null),                     -- Особенности
    (19, 18,'Стекло' , null, null, null, null, null),                     -- Материал столешницы
    (19, 19,'металл'     , null, null, null, null, null),                     -- Материал основания
    (19, 24,'Круглые'   , null, null, null, null, null),                     -- Форма

    -- Стол обеденный «Брик» Чёрный
    (20, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (20, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (20, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (20, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (20, 5, 'ЛДСП'   , null, null, null, null, null),                     -- Материалы
    (20, 5, 'Дерево'   , null, null, null, null, null),                   -- Материалы
    (20, 6, 'Скандинавский (IKEA)'   ,  null, null, null, null, null),    -- Стиль
    (20, 7, 'Нераскладной'   , null, null, null, null, null),             -- Тип
    (20, 8, 'Средний'   , null, null, null, null, null),                  -- Размерность
    (20, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),    -- Срок службы
    (20, 11,null , null, null, null, null, null),                         -- Гарантия
    (20, 12,'Россия'     , null, null, null, null, null),                 -- Страна-производитель
    (20, 13,'Для кухни'  , null, null, null, null, null),                 -- Назначение
    (20, 14,'Дорогие'    , null, null, null, null, null),                 -- Ценовой диапазон
    (20, 15,'Матовые'    , null, null, null, null, null),                 -- Особенности
    (20, 18,'Дерево.' , null, null, null, null, null),                    -- Материал столешницы
    (20, 19,'массив'     , null, null, null, null, null),                 -- Материал основания
    (20, 24,'Овальные'   , null, null, null, null, null),                 -- Форма

    -- Стол обеденный «СО 3» Белый
    (21, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (21, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (21, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (21, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (21, 5, 'ЛДСП'   , null, null, null, null, null),                     -- Материалы
    (21, 6, 'Дерево'   , null, null, null, null, null),                   -- Материалы
    (21, 7, 'Скандинавский (IKEA)'   ,  null, null, null, null, null),    -- Стиль
    (21, 8, 'Нераскладной'   , null, null, null, null, null),             -- Тип
    (21, 9, 'Средний'   , null, null, null, null, null),                  -- Размерность
    (21, 11,null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),    -- Срок службы
    (21, 12,null , null, null, null, null, null),                         -- Гарантия
    (21, 13,'Россия'     , null, null, null, null, null),                 -- Страна-производитель
    (21, 14,'Для кухни'  , null, null, null, null, null),                 -- Назначение
    (21, 15,'Дорогие'    , null, null, null, null, null),                 -- Ценовой диапазон
    (21, 18,'Матовые'    , null, null, null, null, null),                 -- Особенности
    (21, 19,'Дерево.' , null, null, null, null, null),                    -- Материал столешницы
    (21, 24,'массив'     , null, null, null, null, null),                 -- Материал основания

    -- Стол обеденный «Ультра»
    (22, 1, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Высота
    (22, 2, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Ширина
    (22, 3, null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (22, 4, null , ROUND(RAND()*(20-50)+50,0), null, null, null, null),    -- Вес
    (22, 5, 'ЛДСП'   , null, null, null, null, null),                     -- Материалы
    (22, 6, 'Дерево'   , null, null, null, null, null),                   -- Материалы
    (22, 7, 'Скандинавский (IKEA)'   ,  null, null, null, null, null),    -- Стиль
    (22, 8, 'Нераскладной'   , null, null, null, null, null),             -- Тип
    (22, 9, 'Средний'   , null, null, null, null, null),                  -- Размерность
    (22, 11,null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),    -- Срок службы
    (22, 12,null , null, null, null, null, null),                         -- Гарантия
    (22, 13,'Россия'     , null, null, null, null, null),                 -- Страна-производитель
    (22, 14,'Для кухни'  , null, null, null, null, null),                 -- Назначение
    (22, 15,'Дорогие'    , null, null, null, null, null),                 -- Ценовой диапазон
    (22, 18,'Матовые'    , null, null, null, null, null),                 -- Особенности
    (22, 19,'Дерево.' , null, null, null, null, null),                    -- Материал столешницы
    (22, 24,'массив'     , null, null, null, null, null),                 -- Материал основания

    -- Шкафы

    -- Модульная гостиная «Токио»
    (23, 1 , null , ROUND(RAND()*(3000-1800)+1800,0), null, null, null, null), -- Высота
    (23, 2 , null , ROUND(RAND()*(3000-2000)+2000,0), null, null, null, null), -- Ширина
    (23, 3 , null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (23, 4 , null , ROUND(RAND()*(120-50)+50,0), null, null, null, null),    -- Вес
    (23, 5 , 'ЛДСП' , null, null, null, null, null),                      -- Материалы
    (23, 6 , 'Модерн' , null, null, null, null, null),                    -- Стиль
    (23, 7 , null , null, null, null, null, null),                        -- Тип
    (23, 8 , 'Большой' , null, null, null, null, null),                   -- Размерность
    (23, 9 , null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),   -- Срок службы
    (23, 11, '' , null, null, null, null, null),                          -- Гарантия
    (23, 12, 'Россия' , null, null, null, null, null),                    -- Страна-производитель
    (23, 13, 'Для гостиной' , null, null, null, null, null),             -- Назначение
    (23, 14, 'Дешевые' , null, null, null, null, null),                   -- Ценовой диапазон
    (23, 15, '' , null, null, null, null, null),                          -- Особенности
    (23, 24, null , null, null, null, null, null),                        -- Форма
    (23, 32, 'Настенный. Напольный.' , null, null, null, null, null),                      -- Тип установки

    -- Шкаф четырёхстворчатый «Милан» Белый
    (24, 1 , null , ROUND(RAND()*(3000-1800)+1800,0), null, null, null, null), -- Высота
    (24, 2 , null , ROUND(RAND()*(3000-2000)+2000,0), null, null, null, null), -- Ширина
    (24, 3 , null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (24, 4 , null , ROUND(RAND()*(200-50)+50,0), null, null, null, null),    -- Вес
    (24, 5 , 'МДФ' , null, null, null, null, null),                     -- Материалы
    (24, 5 , 'ЛДСП' , null, null, null, null, null),                     -- Материалы
    (24, 6 , null ,  null, null, null, null, null),                    -- Стиль
    (24, 7 , null , null, null, null, null, null),                     -- Тип
    (24, 8 , null , null, null, null, null, null),                     -- Размерность
    (24, 9 , null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (24, 11, '36 месяцев' , null, null, null, null, null),              -- Гарантия
    (24, 12, null , null, null, null, null, null),                      -- Страна-производитель
    (24, 13, 'Для гостиной. В спальню.' , null, null, null, null, null), -- Назначение
    (24, 14, 'Дорогой' , null, null, null, null, null),                      -- Ценовой диапазон
    (24, 15, '' , null, null, null, null, null),                      -- Особенности
    (24, 24, '' , null, null, null, null, null),                      -- Форма
    (24, 32, 'Напольный' , null, null, null, null, null),                      -- Тип установки

    -- Гостиная «МГС 5»
    (25, 1 , null , ROUND(RAND()*(3000-1800)+1800,0), null, null, null, null), -- Высота
    (25, 2 , null , ROUND(RAND()*(3000-2000)+2000,0), null, null, null, null), -- Ширина
    (25, 3 , null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (25, 4 , null , ROUND(RAND()*(120-50)+50,0), null, null, null, null),    -- Вес
    (25, 5 , 'ЛДСП' , null, null, null, null, null),                     -- Материалы
    (25, 6 , 'Современный' ,  null, null, null, null, null),                    -- Стиль
    (25, 7 , null , null, null, null, null, null),                     -- Тип
    (25, 8 , null , null, null, null, null, null),                     -- Размерность
    (25, 9 , null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (25, 11, null , null, null, null, null, null),                     -- Гарантия
    (25, 12, 'Россия' , null, null, null, null, null),                 -- Страна-производитель
    (25, 13, '' , null, null, null, null, null),                      -- Назначение
    (25, 14, 'Недорогие' , null, null, null, null, null),             -- Ценовой диапазон
    (25, 15, 'С полкой' , null, null, null, null, null),  -- Особенности
    (25, 15, 'С дверцами' , null, null, null, null, null),  -- Особенности
    (25, 24, 'Прямоугольные' , null, null, null, null, null),         -- Форма
    (25, 32, 'Напольная' , null, null, null, null, null),              -- Тип установки

    -- Шкаф-купе корпус 1,5м "Лотос/Орфей"
    (26, 1 , null , ROUND(RAND()*(3000-1800)+1800,0), null, null, null, null), -- Высота
    (26, 2 , null , ROUND(RAND()*(3000-2000)+2000,0), null, null, null, null), -- Ширина
    (26, 3 , null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (26, 4 , null , ROUND(RAND()*(120-50)+50,0), null, null, null, null),           -- Вес
    (26, 5 , 'ЛДСП' , null, null, null, null, null),                                -- Материалы
    (26, 6 , 'Современный, Хай-тек, Скандинавский' ,  null, null, null, null, null),-- Стиль
    (26, 7 , 'Прямые' , null, null, null, null, null),                              -- Тип
    (26, 8 , 'Большие, Двухдверные, Стандартные' , null, null, null, null, null),   -- Размерность
    (26, 9 , null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),             -- Срок службы
    (26, 11, '12 месяцев' , null, null, null, null, null),                          -- Гарантия
    (26, 12, 'Россия' , null, null, null, null, null),                              -- Страна-производитель
    (26, 13, 'Для гостиной' , null, null, null, null, null),                        -- Назначение
    (26, 14, 'Средний' , null, null, null, null, null),                             -- Ценовой диапазон
    (26, 15, '' , null, null, null, null, null),                                    -- Особенности
    (26, 24, '' , null, null, null, null, null),                                    -- Форма
    (26, 32, '' , null, null, null, null, null),                                    -- Тип установки

    -- Шкаф-купе Лотос-1 1,7м
    (27, 1 , null , ROUND(RAND()*(3000-1800)+1800,0), null, null, null, null), -- Высота
    (27, 2 , null , ROUND(RAND()*(3000-2000)+2000,0), null, null, null, null), -- Ширина
    (27, 3 , null , ROUND(RAND()*(760-500)+500,0), null, null, null, null), -- Глубина
    (27, 4 , null , ROUND(RAND()*(120-50)+50,0), null, null, null, null),    -- Вес
    (27, 5 , 'ЛДСП' , null, null, null, null, null),                                -- Материалы
    (27, 6 , 'Современный, Хай-тек, Скандинавский' ,  null, null, null, null, null),-- Стиль
    (27, 7 , 'Прямые' , null, null, null, null, null),                              -- Тип
    (27, 8 , 'Большие, Двухдверные, Стандартные' , null, null, null, null, null),   -- Размерность
    (27, 9 , null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),             -- Срок службы
    (27, 11, '12 месяцев' , null, null, null, null, null),                          -- Гарантия
    (27, 12, 'Россия' , null, null, null, null, null),                              -- Страна-производитель
    (27, 13, 'Для гостиной' , null, null, null, null, null),                        -- Назначение
    (27, 14, 'Средний' , null, null, null, null, null),                             -- Ценовой диапазон
    (27, 15, '' , null, null, null, null, null),                                    -- Особенности
    (27, 24, '' , null, null, null, null, null),                                    -- Форма
    (27, 32, '' , null, null, null, null, null),                                    -- Тип установки

    -- Кровати

    -- Диван-кровать №1 Дуб Ясень Анкор
    (28, 1, null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (28, 2, null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (28, 3, null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (28, 4, null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),    -- Вес
    (28, 5, 'ЛДСП EGGER'   , null, null, null, null, null),                     -- Материалы
    (28, 6, ''   ,  null, null, null, null, null),                    -- Стиль
    (28, 7, ''   , null, null, null, null, null),                     -- Тип
    (28, 8, ''   , null, null, null, null, null),                     -- Размерность
    (28, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),-- Срок службы
    (28, 11,'36 месяцев'   , null, null, null, null, null),                     -- Гарантия
    (28, 12,'Для спальной'   , null, null, null, null, null),                     -- Страна-производитель
    (28, 13,''   , null, null, null, null, null),                     -- Назначение
    (28, 14,'Средний'   , null, null, null, null, null),                     -- Ценовой диапазон
    (28, 15,''   , null, null, null, null, null),                     -- Особенности
    (28, 20,'ЛДСП'   , null, null, null, null, null),                     -- Материал корпуса
    (28, 22,'ЛДСП'   , null, null, null, null, null),                     -- Материал основания под матрас
    (28, 24,''   , null, null, null, null, null),                     -- Форма
    (28, 27,''   , null, null, null, null, null),                     -- Размер спального места
    (28, 28,''   , null, null, null, null, null),                     -- Материал обивки
    (28, 29,null   , null, null, null, null, null),                     -- Высота изголовья
    (28, 35,''   , null, null, null, null, null),                     -- Наличие матраса
    (28, 36,null   , null, null, null, null, null),                     -- Высота изножья

    -- ДМ-09 Кровать «Вега» 0,8 м
    (29, 1, null , ROUND(RAND()*(600-500)+500,0), null, null, null, null),    -- Высота
    (29, 2, null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (29, 3, null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (29, 4, null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),       -- Вес
    (29, 5, 'ЛДСП'   , null, null, null, null, null),                          -- Материалы
    (29, 6, 'Скандинавский'   ,  null, null, null, null, null),                -- Стиль
    (29, 7, ''   , null, null, null, null, null),                              -- Тип
    (29, 8, 'Средние'   , null, null, null, null, null),                       -- Размерность
    (29, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),         -- Срок службы
    (29, 11,'12 месяцев'   , null, null, null, null, null),                    -- Гарантия
    (29, 12,'Для спальни'   , null, null, null, null, null),                   -- Страна-производитель
    (29, 13,''   , null, null, null, null, null),                              -- Назначение
    (29, 14,''   , null, null, null, null, null),                              -- Ценовой диапазон
    (29, 15,''   , null, null, null, null, null),                              -- Особенности
    (29, 20,'ЛДСП'   , null, null, null, null, null),                          -- Материал корпуса
    (29, 22,''   , null, null, null, null, null),                              -- Материал основания под матрас
    (29, 24,'Клаассчиеская'   , null, null, null, null, null),                 -- Форма
    (29, 27,''   , null, null, null, null, null),                              -- Размер спального места
    (29, 28,''   , null, null, null, null, null),                              -- Материал обивки
    (29, 29,null   , null, null, null, null, null),                              -- Высота изголовья
    (29, 35,'Матрас приобретается отдельно'   , null, null, null, null, null), -- Наличие матраса
    (29, 36,null   , null, null, null, null, null),                     -- Высота изножья

    -- Кровать двуспальная 1,6 м «Токио»
    (30, 1, null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (30, 2, null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (30, 3, null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (30, 4, null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),    -- Вес
    (30, 5, 'ЛДСП'   , null, null, null, null, null),                          -- Материалы
    (30, 6, 'Скандинавский'   ,  null, null, null, null, null),                -- Стиль
    (30, 7, ''   , null, null, null, null, null),                              -- Тип
    (30, 8, 'Средние'   , null, null, null, null, null),                       -- Размерность
    (30, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),         -- Срок службы
    (30, 11,'12 месяцев'   , null, null, null, null, null),                    -- Гарантия
    (30, 12,'Для спальни'   , null, null, null, null, null),                   -- Страна-производитель
    (30, 13,''   , null, null, null, null, null),                              -- Назначение
    (30, 14,''   , null, null, null, null, null),                              -- Ценовой диапазон
    (30, 15,''   , null, null, null, null, null),                              -- Особенности
    (30, 20,'ЛДСП'   , null, null, null, null, null),                          -- Материал корпуса
    (30, 22,''   , null, null, null, null, null),                              -- Материал основания под матрас
    (30, 24,'Клаассчиеская'   , null, null, null, null, null),                 -- Форма
    (30, 27,''   , null, null, null, null, null),                              -- Размер спального места
    (30, 28,''   , null, null, null, null, null),                              -- Материал обивки
    (30, 29,null   , null, null, null, null, null),                              -- Высота изголовья
    (30, 35,'Матрас приобретается отдельно'   , null, null, null, null, null), -- Наличие матраса
    (30, 36,null   , null, null, null, null, null),                     -- Высота изножья

    -- Кровать-диван с ящиками 0.9*2м «Грей» с фотопечатью
    (31, 1, null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (31, 2, null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (31, 3, null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (31, 4, null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),    -- Вес
    (31, 5, 'ЛДСП'   , null, null, null, null, null),                          -- Материалы
    (31, 6, 'Скандинавский'   ,  null, null, null, null, null),                -- Стиль
    (31, 7, ''   , null, null, null, null, null),                              -- Тип
    (31, 8, 'Средние'   , null, null, null, null, null),                       -- Размерность
    (31, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),         -- Срок службы
    (31, 11,'12 месяцев'   , null, null, null, null, null),                    -- Гарантия
    (31, 12,'Для спальни'   , null, null, null, null, null),                   -- Страна-производитель
    (31, 13,''   , null, null, null, null, null),                              -- Назначение
    (31, 14,''   , null, null, null, null, null),                              -- Ценовой диапазон
    (31, 15,''   , null, null, null, null, null),                              -- Особенности
    (31, 20,'ЛДСП'   , null, null, null, null, null),                          -- Материал корпуса
    (31, 22,''   , null, null, null, null, null),                              -- Материал основания под матрас
    (31, 24,'Клаассчиеская'   , null, null, null, null, null),                 -- Форма
    (31, 27,''   , null, null, null, null, null),                              -- Размер спального места
    (31, 28,''   , null, null, null, null, null),                              -- Материал обивки
    (31, 29,null   , null, null, null, null, null),                              -- Высота изголовья
    (31, 35,'Матрас приобретается отдельно'   , null, null, null, null, null), -- Наличие матраса
    (31, 36,null   , null, null, null, null, null),                     -- Высота изножья

    -- Кровать 1.8 м КР-101 «Александрия»
    (32, 1, null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (32, 2, null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (32, 3, null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (32, 4, null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),    -- Вес
    (32, 5, 'ЛДСП'   , null, null, null, null, null),                          -- Материалы
    (32, 6, 'Скандинавский'   ,  null, null, null, null, null),                -- Стиль
    (32, 7, ''   , null, null, null, null, null),                              -- Тип
    (32, 8, 'Средние'   , null, null, null, null, null),                       -- Размерность
    (32, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),         -- Срок службы
    (32, 11,'12 месяцев'   , null, null, null, null, null),                    -- Гарантия
    (32, 12,'Для спальни'   , null, null, null, null, null),                   -- Страна-производитель
    (32, 13,''   , null, null, null, null, null),                              -- Назначение
    (32, 14,''   , null, null, null, null, null),                              -- Ценовой диапазон
    (32, 15,''   , null, null, null, null, null),                              -- Особенности
    (32, 20,'ЛДСП'   , null, null, null, null, null),                          -- Материал корпуса
    (32, 22,''   , null, null, null, null, null),                              -- Материал основания под матрас
    (32, 24,'Классическая'   , null, null, null, null, null),                 -- Форма
    (32, 27,''   , null, null, null, null, null),                              -- Размер спального места
    (32, 28,''   , null, null, null, null, null),                              -- Материал обивки
    (32, 29,null   , null, null, null, null, null),                              -- Высота изголовья
    (32, 35,'Матрас приобретается отдельно'   , null, null, null, null, null), -- Наличие матраса
    (32, 36,null   , null, null, null, null, null),                     -- Высота изножья



    -- Кровать 1.8 м КР-101 «Александрия»
    (32, 1, null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (32, 2, null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (32, 3, null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (32, 4, null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),    -- Вес
    (32, 5, 'ЛДСП'   , null, null, null, null, null),                          -- Материалы
    (32, 6, 'Скандинавский'   ,  null, null, null, null, null),                -- Стиль
    (32, 7, ''   , null, null, null, null, null),                              -- Тип
    (32, 8, 'Средние'   , null, null, null, null, null),                       -- Размерность
    (32, 9, null , ROUND(RAND()*(7-12)+12,0), null, null, null, null),         -- Срок службы
    (32, 11,'12 месяцев'   , null, null, null, null, null),                    -- Гарантия
    (32, 12,'Для спальни'   , null, null, null, null, null),                   -- Страна-производитель
    (32, 13,''   , null, null, null, null, null),                              -- Назначение
    (32, 14,''   , null, null, null, null, null),                              -- Ценовой диапазон
    (32, 15,''   , null, null, null, null, null),                              -- Особенности
    (32, 20,'ЛДСП'   , null, null, null, null, null),                          -- Материал корпуса
    (32, 22,''   , null, null, null, null, null),                              -- Материал основания под матрас
    (32, 24,'Классическая'   , null, null, null, null, null),                 -- Форма
    (32, 27,''   , null, null, null, null, null),                              -- Размер спального места
    (32, 28,''   , null, null, null, null, null),                              -- Материал обивки
    (32, 29,null   , null, null, null, null, null),                              -- Высота изголовья
    (32, 35,'Матрас приобретается отдельно'   , null, null, null, null, null), -- Наличие матраса
    (32, 36,null   , null, null, null, null, null),                     -- Высота изножья

    -- Прихожие

    -- Прихожая Ксения-2
    (51, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (51, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (51, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (51, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),-- Вес
    (51, 5 ,  'ЛДСП' , null, null, null, null, null),                                   -- Материалы
    (51, 6 ,  'Классический' ,  null, null, null, null, null),                          -- Стиль
    (51, 7 ,  null , null, null, null, null, null),                                     -- Тип
    (51, 8 ,  '	Узкие. Высокие' , null, null, null, null, null),                        -- Размерность
    (51, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),                 -- Срок службы
    (51, 11,  null , null, null, null, null, null),                                     -- Гарантия
    (51, 12,  'Россия' , null, null, null, null, null),                                 -- Страна-производитель
    (51, 13,  null , null, null, null, null, null),                                     -- Назначение
    (51, 14,  'Недорогие' , null, null, null, null, null),                              -- Ценовой диапазон
    (51, 15,  'С ящиком.' , null, null, null, null, null),-- Особенности
    (51, 15,  'С полкой' , null, null, null, null, null),-- Особенности
    (51, 15,  'С дверцами' , null, null, null, null, null),-- Особенности
    (51, 15,  'С зеркалом' , null, null, null, null, null),-- Особенности
    (51, 30,  null , null, null, null, null, null),                     -- Тип направляющих
    (51, 31,  null , null, null, null, null, null),                     -- Материал ручек

    -- Прихожая Лига
    (52, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (52, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (52, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (52, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),-- Вес
    (52, 5 ,  'ЛДСП' , null, null, null, null, null),                  -- Материалы
    (52, 6 ,  'Классический' ,  null, null, null, null, null),         -- Стиль
    (52, 7 ,  null , null, null, null, null, null),                    -- Тип
    (52, 8 ,  '	Узкие. Высокие' , null, null, null, null, null),       -- Размерность
    (52, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),-- Срок службы
    (52, 11,  null , null, null, null, null, null),                    -- Гарантия
    (52, 12,  'Россия' , null, null, null, null, null),                -- Страна-производитель
    (52, 13,  null , null, null, null, null, null),                    -- Назначение
    (52, 14,  'Недорогие' , null, null, null, null, null),             -- Ценовой диапазон
    (52, 15,  'С ящиком.' , null, null, null, null, null),             -- Особенности
    (52, 15,  'С полкой' , null, null, null, null, null),              -- Особенности
    (52, 15,  'С дверцами' , null, null, null, null, null),            -- Особенности
    (52, 15,  'С зеркалом' , null, null, null, null, null),            -- Особенности
    (52, 30,  'Шариковые' , null, null, null, null, null),             -- правляющих
    (52, 31,  null , null, null, null, null, null),                     -- Материал ручек

    -- Прихожая Лира NEW
    (53, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (53, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (53, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (53, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),-- Вес
    (53, 5 ,  'ЛДСП' , null, null, null, null, null),                                   -- Материалы
    (53, 6 ,  'Классический' ,  null, null, null, null, null),                          -- Стиль
    (53, 7 ,  null , null, null, null, null, null),                                     -- Тип
    (53, 8 ,  '	Узкие. Высокие' , null, null, null, null, null),                        -- Размерность
    (53, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),                 -- Срок службы
    (53, 11,  null , null, null, null, null, null),                                     -- Гарантия
    (53, 12,  'Россия' , null, null, null, null, null),                                 -- Страна-производитель
    (53, 13,  null , null, null, null, null, null),                                     -- Назначение
    (53, 14,  'Недорогие' , null, null, null, null, null),                              -- Ценовой диапазон
    (53, 15,  'С ящиком.' , null, null, null, null, null),                              -- Особенности
    (53, 15,  'С полкой' , null, null, null, null, null),                               -- Особенности
    (53, 15,  'С дверцами' , null, null, null, null, null),                             -- Особенности
    (53, 15,  'С зеркалом' , null, null, null, null, null),                             -- Особенности
    (53, 30,  'Шариковые' , null, null, null, null, null),                              -- Тип направляющих
    (53, 31,  null , null, null, null, null, null),                                     -- Материал ручек

    -- Прихожая Трамп
    (54, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (54, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (54, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (54, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),-- Вес
    (54, 5 ,  'ЛДСП' , null, null, null, null, null),                                   -- Материалы
    (54, 6 ,  'Классический' ,  null, null, null, null, null),                          -- Стиль
    (54, 7 ,  null , null, null, null, null, null),                                     -- Тип
    (54, 8 ,  '	Узкие. Высокие' , null, null, null, null, null),                        -- Размерность
    (54, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),                 -- Срок службы
    (54, 11,  null , null, null, null, null, null),                                     -- Гарантия
    (54, 12,  'Россия' , null, null, null, null, null),                                 -- Страна-производитель
    (54, 13,  null , null, null, null, null, null),                                     -- Назначение
    (54, 14,  'Недорогие' , null, null, null, null, null),                              -- Ценовой диапазон
    (54, 15,  'С ящиком.' , null, null, null, null, null),-- Особенности
    (54, 15,  'С полкой' , null, null, null, null, null),-- Особенности
    (54, 15,  'С дверцами' , null, null, null, null, null),-- Особенности
    (54, 15,  'С зеркалом' , null, null, null, null, null),-- Особенности
    (54, 30,  'Шариковые' , null, null, null, null, null),                              -- Тип направляющих
    (54, 31,  null , null, null, null, null, null),                                     -- Материал ручек

    -- Прихожая Сити лоредо
    (55, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null), -- Высота
    (55, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (55, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (55, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),-- Вес
    (55, 5 ,  'ЛДСП' , null, null, null, null, null),                                   -- Материалы
    (55, 6 ,  'Модерн' ,  null, null, null, null, null),                          -- Стиль
    (55, 7 ,  null , null, null, null, null, null),                                     -- Тип
    (55, 8 ,  '	Узкие. Высокие' , null, null, null, null, null),                        -- Размерность
    (55, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),                 -- Срок службы
    (55, 11,  null , null, null, null, null, null),                                     -- Гарантия
    (55, 12,  'Россия' , null, null, null, null, null),                                 -- Страна-производитель
    (55, 13,  null , null, null, null, null, null),                                     -- Назначение
    (55, 14,  'Недорогие' , null, null, null, null, null),                              -- Ценовой диапазон
    (55, 15,  'С дверцами' , null, null, null, null, null),                             -- Особенности
    (55, 15,  'С зеркалом' , null, null, null, null, null),                             -- Особенности
    (55, 30,  'Шариковые' , null, null, null, null, null),                              -- Тип направляющих
    (55, 31,  null , null, null, null, null, null),                                     -- Материал ручек

    -- Кресла-кровати

    -- Кресло-кровать Salotti Альфа
    (33, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null),    -- Высота
    (33, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (33, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (33, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),      -- Вес
    (33, 5 ,  'Дерево' , null, null, null, null, null),                    -- Материалы
    (33, 5 ,  'Ткань' , null, null, null, null, null),                     -- Материалы
    (33, 6 ,  'Современный' ,  null, null, null, null, null),                    -- Стиль
    (33, 7 ,  null , null, null, null, null, null),                     -- Тип
    (33, 8 ,  'Большие' , null, null, null, null, null),                       -- Размерность
    (33, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (33, 11,  '12 мес.' , null, null, null, null, null),                       -- Гарантия
    (33, 12,  null , null, null, null, null, null),                     -- Страна-производитель
    (33, 13,  'Для гостиной' , null, null, null, null, null),           -- Назначение
    (33, 14,  'Недорогие' , null, null, null, null, null),              -- Ценовой диапазон
    (33, 15,  'С подлокотниками' , null, null, null, null, null),       -- Особенности
    (33, 15,  'С подушкой в комплекте' , null, null, null, null, null), -- Особенности
    (33, 16,  'Выкатной' , null, null, null, null, null),                       -- Механизм трансформации
    (33, 17,  null , null, null, null, null, null),                     -- Материал каркаса
    (33, 24,  'Прямоугольные' , null, null, null, null, null),          -- Форма
    (33, 26,  null , null, null, null, null, null),                     -- Наполнение

    -- Кресло-кровать Лига Диванов Сенатор 60
    (34, 1 ,  null , ROUND(RAND()*(600-500)+500,0), null, null, null, null),    -- Высота
    (34, 2 ,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (34, 3 ,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (34, 4 ,  null , ROUND(RAND()*(100-60)+60,0), null, null, null, null),      -- Вес
    (34, 5 ,  'Искусственная кожа' , null, null, null, null, null),                     -- Материалы
    (34, 5 ,  'Ткань' , null, null, null, null, null),                     -- Материалы
    (34, 5 ,  'ЛДСП' , null, null, null, null, null),                     -- Материалы
    (34, 5 ,  'Велюр' , null, null, null, null, null),                     -- Материалы
    (34, 5 ,  'Экокожа' , null, null, null, null, null),                     -- Материалы
    (34, 6 ,  'Современный' ,  null, null, null, null, null),           -- Стиль
    (34, 7 ,  null , null, null, null, null, null),                     -- Тип
    (34, 8 ,  'Большие' , null, null, null, null, null),                       -- Размерность
    (34, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (34, 11,  null , null, null, null, null, null),                       -- Гарантия
    (34, 12,  'Россия' , null, null, null, null, null),                     -- Страна-производитель
    (34, 13,  'Для гостиной' , null, null, null, null, null),                       -- Назначение
    (34, 14,  'Недорогие' , null, null, null, null, null),                       -- Ценовой диапазон
    (34, 15,  'С подлокотниками.' , null, null, null, null, null),                       -- Особенности
    (34, 15,  'С деревянными подлокотниками' , null, null, null, null, null),-- Особенности
    (34, 16,  '' , null, null, null, null, null),                       -- Механизм трансформации
    (34, 17,  null , null, null, null, null, null),                     -- Материал каркаса
    (34, 24,  '' , null, null, null, null, null),                       -- Форма
    (34, 26,  '	ППУ' , null, null, null, null, null),                     -- Наполнение

    -- Матрасы

    -- Матрас Comforto
    (35, 1,  null , ROUND(RAND()*(250-170)+170,0), null, null, null, null),    -- Высота
    (35, 2,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (35, 3,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (35, 12,  'Россия' , null, null, null, null, null),                        -- Страна-производитель
    (35, 14,  '' ,  null, null, null, null, null),                       -- Ценовой диапазон
    (35, 15,  '' , null, null, null, null, null),                        -- Особенности
    (35, 26,  'Elafoam' , null, null, null, null, null),                 -- Наполнение
    (35, 27,  null , null, null, null, null, null),                      -- Размер спального места
    (35, 33,  null , 110, null, null, null, null),                      -- Нагрузка
    (35, 38,  'Средний' , null, null, null, null, null),                      -- Жесткость
    (35, 39,  'Независимый пружинный блок TFK' , null, null, null, null, null),  -- Тип пружинного блока
    (35, 40,  null , 256, null, null, null, null),                 -- Количество пружин на м²

    -- Матрас Comfo холло микс
    (36, 1,  null , ROUND(RAND()*(250-170)+170,0), null, null, null, null),    -- Высота
    (36, 2,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (36, 3,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (36, 12,  'Россия' , null, null, null, null, null),                        -- Страна-производитель
    (36, 14,  'Средний' ,  null, null, null, null, null),                       -- Ценовой диапазон
    (36, 15,  '' , null, null, null, null, null),                        -- Особенности
    (36, 26,  'Кокосовая койра' , null, null, null, null, null),                      -- Наполнение
    (36, 27,  null , null, null, null, null, null),                      -- Размер спального места
    (36, 33,  null , 120, null, null, null, null),                      -- Нагрузка
    (36, 38,  'Разная жёсткость сторон' , null, null, null, null, null),                      -- Жесткость
    (36, 39,  'Независимый пружинный блок TFK' , null, null, null, null, null),-- Тип пружинного блока
    (36, 40,  null , 256, null, null, null, null),                      -- Количество пружин на м²

    -- Матрас Norma
    (37, 1,  null , ROUND(RAND()*(250-170)+170,0), null, null, null, null),    -- Высота
    (37, 2,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (37, 3,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (37, 12,  'Россия' , null, null, null, null, null),                        -- Страна-производитель
    (37, 14,  'Дешевые' ,  null, null, null, null, null),                       -- Ценовой диапазон
    (37, 15,  '' , null, null, null, null, null),                       -- Особенности
    (37, 26,  'Elafoam' , null, null, null, null, null),                -- Наполнение
    (37, 27,  null , null, null, null, null, null),                     -- Размер спального места
    (37, 33,  null , 110, null, null, null, null),                      -- Нагрузка
    (37, 38,  'Средний' , null, null, null, null, null),                      -- Жесткость
    (37, 39,  'Пружинный блок Bonnel' , null, null, null, null, null),   -- Тип пружинного блока
    (37, 40,  null , 256, null, null, null, null),                      -- Количество пружин на м²

    -- Матрас Comfo сезон
    (38, 1,  null , ROUND(RAND()*(250-170)+170,0), null, null, null, null),    -- Высота
    (38, 2,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (38, 3,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (38, 12,  'Россия' , null, null, null, null, null),                        -- Страна-производитель
    (38, 14,  'Дешевые' ,  null, null, null, null, null),                       -- Ценовой диапазон
    (38, 15,  '' , null, null, null, null, null),                        -- Особенности
    (38, 26,  'Кокосовая койра' , null, null, null, null, null),                      -- Наполнение
    (38, 27,  null , null, null, null, null, null),                      -- Размер спального места
    (38, 33,  null , 120, null, null, null, null),                      -- Нагрузка
    (38, 38,  'Разная жёсткость сторон' , null, null, null, null, null),                      -- Жесткость
    (38, 39,  null , null, null, null, null, null),                      -- Тип пружинного блока
    (38, 40,  null , 256, null, null, null, null),                      -- Количество пружин на м²

    -- Матрас Extra микс
    (39, 1,  null , ROUND(RAND()*(250-170)+170,0), null, null, null, null),    -- Высота
    (39, 2,  null , ROUND(RAND()*(2200-1300)+1300,0), null, null, null, null), -- Ширина
    (39, 3,  null , ROUND(RAND()*(2300-1900)+1900,0), null, null, null, null), -- Глубина
    (39, 12,  'Россия' , null, null, null, null, null),                        -- Страна-производитель
    (39, 14,  'Средний' ,  null, null, null, null, null),                      -- Ценовой диапазон
    (39, 15,  '' , null, null, null, null, null),                        -- Особенности
    (39, 26,  'Кокосовая койра' , null, null, null, null, null),         -- Наполнение
    (39, 27,  '1500x2000' , null, null, null, null, null),                      -- Размер спального места
    (39, 33,  null , 130, null, null, null, null),                       -- Нагрузка
    (39, 38,  'Разная жёсткость сторон' , null, null, null, null, null), -- Жесткость
    (39, 39,  'Беспружинный' , null, null, null, null, null),            -- Тип пружинного блока
    (39, 40,  null , null, null, null, null, null),                      -- Количество пружин на м²

    -- Пуфы

    -- Пуф «Квадратик» Венге
    (40, 1 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null),    -- Высота
    (40, 2 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Ширина
    (40, 3 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Глубина
    (40, 5 ,  'Экокожа' , null, null, null, null, null),                     -- Материалы
    (40, 6 ,  null ,  null, null, null, null, null),                    -- Стиль
    (40, 7 ,  null , null, null, null, null, null),                     -- Тип
    (40, 8 ,  null , null, null, null, null, null),                     -- Размерность
    (40, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (40, 11,  null , null, null, null, null, null),                     -- Гарантия
    (40, 12,  'Россия' , null, null, null, null, null),                 -- Страна-производитель
    (40, 13,  null , null, null, null, null, null),                     -- Назначение
    (40, 14,  'Средний' , null, null, null, null, null),                -- Ценовой диапазон
    (40, 15,  null , null, null, null, null, null),                     -- Особенности
    (40, 24,  'Квадратные' , null, null, null, null, null),                     -- Форма

    -- Пуф «Груша»
    (41, 1 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null),    -- Высота
    (41, 2 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Ширина
    (41, 3 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Глубина
    (41, 5 ,  'Велюр' , null, null, null, null, null),                     -- Материалы
    (41, 6 ,  null ,  null, null, null, null, null),                    -- Стиль
    (41, 7 ,  null , null, null, null, null, null),                     -- Тип
    (41, 8 ,  null , null, null, null, null, null),                     -- Размерность
    (41, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (41, 11,  null , null, null, null, null, null),                     -- Гарантия
    (41, 12,  'Россия' , null, null, null, null, null),                 -- Страна-производитель
    (41, 13,  null , null, null, null, null, null),                     -- Назначение
    (41, 14,  'Дорогой' , null, null, null, null, null),                     -- Ценовой диапазон
    (41, 15,  null , null, null, null, null, null),                     -- Особенности
    (41, 24,  null , null, null, null, null, null),                     -- Форма

    -- Пуфик Betel КЛАССИК
    (43, 1 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null),    -- Высота
    (43, 2 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Ширина
    (43, 3 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Глубина
    (43, 5 ,  null , null, null, null, null, null),                     -- Материалы
    (43, 6 ,  null ,  null, null, null, null, null),                    -- Стиль
    (43, 7 ,  null , null, null, null, null, null),                     -- Тип
    (43, 8 ,  'Маленькие' , null, null, null, null, null),                     -- Размерность
    (43, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (43, 11,  null , null, null, null, null, null),                     -- Гарантия
    (43, 12,  'Россия' , null, null, null, null, null),                 -- Страна-производитель
    (43, 13,  '	Для спальни.Для гостиной.Для прихожей' , null, null, null, null, null),                     -- Назначение
    (43, 14,  null , null, null, null, null, null),                     -- Ценовой диапазон
    (43, 15,  'С ящиком' , null, null, null, null, null),                     -- Особенности
    (43, 15,  'С мягким сиденьем' , null, null, null, null, null),            -- Особенности
    (43, 24,  'Квадратные' , null, null, null, null, null),                     -- Форма

    -- Пуф STOOL GROUP Шарлотта с ящиком
    (42, 1 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null),    -- Высота
    (42, 2 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Ширина
    (42, 3 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Глубина
    (42, 5 ,  'Металл' , null, null, null, null, null),                     -- Материалы
    (42, 5 ,  'Ткань' , null, null, null, null, null),                     -- Материалы
    (42, 6 ,  null ,  null, null, null, null, null),                    -- Стиль
    (42, 7 ,  null , null, null, null, null, null),                     -- Тип
    (42, 8 ,  'Маленькие' , null, null, null, null, null),              -- Размерность
    (42, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (42, 11,  null , null, null, null, null, null),                     -- Гарантия
    (42, 12,  'Китай' , null, null, null, null, null),                 -- Страна-производитель
    (42, 13,  'Для спальни.Для гостиной.Для прихожей.Для детской.Для мальчика.Для девочки.Для подростка.Для школьника' , null, null, null, null, null),-- Назначение
    (42, 14,  'Недорогие' , null, null, null, null, null),                     -- Ценовой диапазон
    (42, 15,  'С ящиком' , null, null, null, null, null),          -- Особенности
    (42, 15,  'С мягким сиденьем' , null, null, null, null, null), -- Особенности
    (42, 24,  'Круглые' , null, null, null, null, null),                     -- Форма

    -- Пуф Столлайн ШАРЛЬ круглый
    (44, 1 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null),    -- Высота
    (44, 2 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Ширина
    (44, 3 ,  null , ROUND(RAND()*(400-250)+500,0), null, null, null, null), -- Глубина
    (44, 5 ,  'Металл' , null, null, null, null, null),                    -- Материалы
    (44, 5 ,  'Ткань' , null, null, null, null, null),                     -- Материалы
    (44, 6 ,  'Современный' ,  null, null, null, null, null),               -- Стиль
    (44, 7 ,  null , null, null, null, null, null),                     -- Тип
    (44, 8 ,  'Маленькие' , null, null, null, null, null),                     -- Размерность
    (44, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (44, 11,  null , null, null, null, null, null),                     -- Гарантия
    (44, 12,  'Россия' , null, null, null, null, null),                 -- Страна-производитель
    (44, 13,  'Для спальни.Для прихожей' , null, null, null, null, null),      -- Назначение
    (44, 14,  'Недорогие' , null, null, null, null, null),                     -- Ценовой диапазон
    (44, 15,  'С мягким сиденьем' , null, null, null, null, null),             -- Особенности
    (44, 15,  'На ножках' , null, null, null, null, null),                     -- Особенности
    (44, 24,  'Круглые' , null, null, null, null, null),                     -- Форма

    -- Тумбы

    -- Прикроватная тумба Наоми МН-021-02 Дуб Ниагара (Р)
    (45, 1 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Высота
    (45, 2 ,  null , ROUND(RAND()*(1600-800)+800,0), null, null, null, null), -- Ширина
    (45, 3 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Глубина
    (45, 4 ,  null , ROUND(RAND()*(60-30)+30,0), null, null, null, null),     -- Вес
    (45, 5 ,  'ЛДСП' , null, null, null, null, null),                  -- Материалы
    (45, 5 ,  'МДФ' , null, null, null, null, null),                   -- Материалы
    (45, 6 ,  'Современный' ,  null, null, null, null, null),          -- Стиль
    (45, 7 ,  null , null, null, null, null, null),                    -- Тип
    (45, 8 ,  'Узкие.Низкие' , null, null, null, null, null),          -- Размерность
    (45, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),-- Срок службы
    (45, 11,  null , null, null, null, null, null),                    -- Гарантия
    (45, 12,  'Беларусь' , null, null, null, null, null),              -- Страна-производитель
    (45, 13,  'Для спальни' , null, null, null, null, null),           -- Назначение
    (45, 14,  'Недорогие' , null, null, null, null, null),             -- Ценовой диапазон
    (45, 15,  'С ящиком' , null, null, null, null, null),              -- Особенности

    -- Тумба прикроватная Слайн-К Арго
    (46, 1 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null),  -- Высота
    (46, 2 ,  null , ROUND(RAND()*(1600-800)+800,0), null, null, null, null), -- Ширина
    (46, 3 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Глубина
    (46, 4 ,  null , ROUND(RAND()*(60-30)+30,0), null, null, null, null),     -- Вес
    (46, 5 ,  'ЛДСП' , null, null, null, null, null),                    -- Материалы
    (46, 5 ,  'МДФ' , null, null, null, null, null),                    -- Материалы
    (46, 6 ,  null , null, null, null, null, null),                    -- Стиль
    (46, 7 ,  null , null, null, null, null, null),                    -- Тип
    (46, 8 ,  null , null, null, null, null, null),                    -- Размерность
    (46, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),-- Срок службы
    (46, 11,  null , null, null, null, null, null),                    -- Гарантия
    (46, 12,  'Россия' , null, null, null, null, null),                    -- Страна-производитель
    (46, 13,  'Для спальни' , null, null, null, null, null),                    -- Назначение
    (46, 14,  'Недорогие' , null, null, null, null, null),                    -- Ценовой диапазон
    (46, 15,  'С ящиком' , null, null, null, null, null),                    -- Особенности

    -- Тумба Шведский Стандарт Мальта
    (47, 1 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null),  -- Высота
    (47, 2 ,  null , ROUND(RAND()*(1600-800)+800,0), null, null, null, null), -- Ширина
    (47, 3 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Глубина
    (47, 4 ,  null , ROUND(RAND()*(60-30)+30,0), null, null, null, null),     -- Вес
    (47, 5 ,  'ЛДСП'  , null, null, null, null, null),                     -- Материалы
    (47, 6 ,  'Современный'  , null, null, null, null, null),                    -- Стиль
    (47, 7 ,  null , null, null, null, null, null),                     -- Тип
    (47, 8 ,  'Узкие.Низкие'  , null, null, null, null, null),                     -- Размерность
    (47, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (47, 11,  null , null, null, null, null, null),                     -- Гарантия
    (47, 12,  'Беларусь'  , null, null, null, null, null),                     -- Страна-производитель
    (47, 13,  'Для спальни'  , null, null, null, null, null),                     -- Назначение
    (47, 14,  'Недорогие'  , null, null, null, null, null),                     -- Ценовой диапазон
    (47, 15,  'С ящиком'  , null, null, null, null, null),                     -- Особенности

    -- Тумба выкатная с 4-мя ящиками МДК ТБ4
    (48, 1 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null),  -- Высота
    (48, 2 ,  null , ROUND(RAND()*(1600-800)+800,0), null, null, null, null), -- Ширина
    (48, 3 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Глубина
    (48, 4 ,  null , ROUND(RAND()*(60-30)+30,0), null, null, null, null),     -- Вес
    (48, 5 ,  'ЛДСП'   , null, null, null, null, null),                     -- Материалы
    (48, 6 ,  'Современный'   , null, null, null, null, null),                    -- Стиль
    (48, 7 ,  null , null, null, null, null, null),                     -- Тип
    (48, 8 ,  'Высокие'   , null, null, null, null, null),                     -- Размерность
    (48, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (48, 11,  null , null, null, null, null, null),                     -- Гарантия
    (48, 12,  'Россия'   , null, null, null, null, null),                     -- Страна-производитель
    (48, 13,  'Офис'   , null, null, null, null, null),                     -- Назначение
    (48, 14,  'Недорогие'   , null, null, null, null, null),                     -- Ценовой диапазон
    (48, 15,  'С ящиком'   , null, null, null, null, null),                     -- Особенности

    -- Тумба Шведский Стандарт Кастор (4 ящика)
    (49, 1 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null),  -- Высота
    (49, 2 ,  null , ROUND(RAND()*(1600-800)+800,0), null, null, null, null), -- Ширина
    (49, 3 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Глубина
    (49, 4 ,  null , ROUND(RAND()*(60-30)+30,0), null, null, null, null),     -- Вес
    (49, 5 ,  'ЛДСП'   , null, null, null, null, null),                     -- Материалы
    (49, 6 ,  'Современный'   , null, null, null, null, null),                    -- Стиль
    (49, 7 ,  null , null, null, null, null, null),                     -- Тип
    (49, 8 ,  'Узкие.Низкие'   , null, null, null, null, null),                     -- Размерность
    (49, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null), -- Срок службы
    (49, 11,  null , null, null, null, null, null),                     -- Гарантия
    (49, 12,  'Беларусь'   , null, null, null, null, null),                     -- Страна-производитель
    (49, 13,  null   , null, null, null, null, null),                     -- Назначение
    (49, 14,  'Недорогие'   , null, null, null, null, null),                     -- Ценовой диапазон
    (49, 15,  'С ящиком'   , null, null, null, null, null),                     -- Особенности

    -- Тумба BTS Тео
    (50, 1 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null),  -- Высота
    (50, 2 ,  null , ROUND(RAND()*(1600-800)+800,0), null, null, null, null), -- Ширина
    (50, 3 ,  null , ROUND(RAND()*(1100-700)+700,0), null, null, null, null), -- Глубина
    (50, 4 ,  null , ROUND(RAND()*(60-30)+30,0), null, null, null, null),     -- Вес
    (50, 5 ,  'ЛДСП'   , null, null, null, null, null),                    -- Материалы
    (50, 6 ,  'Современный'   , null, null, null, null, null),                    -- Стиль
    (50, 7 ,  null , null, null, null, null, null),                    -- Тип
    (50, 8 ,  'Узкие.Низкие'   , null, null, null, null, null),                    -- Размерность
    (50, 9 ,  null , ROUND(RAND()*(17-7)+7,0), null, null, null, null),-- Срок службы
    (50, 11,  null , null, null, null, null, null),                    -- Гарантия
    (50, 12,  'Россия'   , null, null, null, null, null),                    -- Страна-производитель
    (50, 13,  'Для спальни'   , null, null, null, null, null),                    -- Назначение
    (50, 14,  'Недорогие'   , null, null, null, null, null),                    -- Ценовой диапазон
    (50, 15,  'На колесиках'   , null, null, null, null, null);                    -- Особенности

-- Добавление записей в таблицу вариантов товара
insert variants_product
(product_id, preview_img, title, price)
values
    -- Диван

    -- Диван Гранд велюр
    (1,'https://cdn.mebelstol.ru/upload/preview/d/divan_mebel_ars_grand_veljur_20.jpg','Шоколад' , 35490),
    (1,'https://cdn.mebelstol.ru/upload/preview/d/divan_mebel_ars_grand_veljur_6_1.jpg','Пудра'  , 35490),
    (1,'https://cdn.mebelstol.ru/upload/preview/d/divan_mebel_ars_grand_veljur_18_1.jpg','Черный', 36500),

    -- Диван «Токио 2»
    (2,'https://svmebel.online/wp-content/uploads/2022/08/divan-tokio-2-pryamoj-seryj-akkordeon-vysokoelastichnyj-ppu-2.jpg','Диван «Токио 2»', 34000),


    -- Диван «Остин»
    (3,'https://svmebel.online/wp-content/uploads/2022/08/divan-ostin-uglovoj-bezhevyj-pantograf-pruzhinnyj-blok-bonnel-1.jpg','Диван «Остин»', 34000),

    -- Диван «Камелот 2»
    (4,'https://svmebel.online/wp-content/uploads/2022/08/divan-kamelot-2-pryamoj-temno-fioletovyj-pantograf-nezavisimyj-pruzhinnyj-blok-1.jpg','Диван «Камелот 2»', 34000),

    -- Соната диван-кровать
    (5,'https://skfo.silvamebel.ru/upload/resize_cache/webp/iblock/494/854_570_1/9tbodcek2qmxbd6p3h8q5668b4mcg2cn.webp','Принт салмон',34000),
    (5,'https://skfo.silvamebel.ru/upload/resize_cache/webp/iblock/0b7/854_570_1/y9l534pwclmk0vgoxq6ihn7rb8col1f7.webp','Микрофибра'  ,34000),
    (5,'https://skfo.silvamebel.ru/upload/resize_cache/webp/iblock/5d9/854_570_1/m7kit3e5z1mz52m5oa9tl78cnznaye4b.webp','М-В Кетс.'   ,34000),

    -- Кухни

    -- Кухня 2,0м BTS Люкс модульная
    (6,'https://cdn.mebelstol.ru/upload/preview/2/2_1150.jpg','Лоза'   ,45000),
    (6,'https://cdn.mebelstol.ru/upload/preview/3/3_860.jpg','Прима'   ,45000),
    (6,'https://cdn.mebelstol.ru/upload/preview/5/5_464.jpg','Акварель',47000),

    -- Кухонный гарнитур Сокол ПН-04
    (7,'https://cdn.mebelstol.ru/upload/preview/1/1121959.jpeg','Дуб сонома.',22000 ),
    (7,'https://cdn.mebelstol.ru/upload/preview/1/1121958.jpeg','Белый/Венге',22000 ),

    -- Кухня 2,0м BTS Тифани
    (8,'https://cdn.mebelstol.ru/upload/preview/1/1_2888.jpg','Кенди/Белый',22000 ),

    -- Кухня 2,0м BTS Скарлетт
    (9,'https://cdn.mebelstol.ru/upload/files/1/1_67.png','Белый',22000),

    -- Кухня BTS Персик 1,8м
    (10,'https://cdn.mebelstol.ru/upload/preview/1/1_2739.jpg','Персик',22000 ),

    -- Обеденные группы

    -- Обеденная группа Sheffilton SHT-DS233
    (11,'https://cdn.mebelstol.ru/upload/preview/2/223064.jpg','Белый/глянцевый',22000),

    -- Стол со стульями Sheffilton SHT-DS81
    (12,'https://cdn.mebelstol.ru/upload/preview/1/153818_8.jpeg','кофейный ликер',ROUND(RAND()*(100000-5000)+5000)),

    -- Обеденная группа Sheffilton SHT-DS236
    (13,'https://cdn.mebelstol.ru/upload/preview/2/223274.jpg','сосна касцина',ROUND(RAND()*(100000-5000)+5000)),

    -- Набор мебели для кухни Leset Говард 1Р+Чейз
    (14,'https://cdn.mebelstol.ru/upload/preview/l/leset_stol_govard_belyj_stul_cheyz_belyj_velutto_32_1.jpg','Белый', ROUND(RAND()*(100000-5000)+5000)),

    -- Комплект изделий Шведский Стандарт
    (15,'https://mebelstol.ru/','Белый лак', ROUND(RAND()*(100000-5000)+5000)),

    -- Столы

    -- Стол RB Круглый
    (16,'https://cdn.mebelstol.ru/upload/preview/5/5501.jpeg','Махагон'                   ,ROUND(RAND()*(100000-5000)+5000)),
    (16,'https://cdn.mebelstol.ru/upload/preview/1/12008.jpg','Орех темный. Массив. Шпон.',ROUND(RAND()*(100000-5000)+5000)),
    (16,'https://cdn.mebelstol.ru/upload/preview/5/5946_1.jpeg','Слоновая кость'          ,ROUND(RAND()*(100000-5000)+5000)),

    -- Стол обеденный RB Орфей-1
    (17,'https://cdn.mebelstol.ru/upload/preview/1/19308_1.jpeg', 'Венге', ROUND(RAND()*(100000-5000)+5000)),

    -- Стол Катрин Ломберный раскладной
    (18,'https://cdn.mebelstol.ru/upload/preview/f/fac37e64821679f9686509c33b95adae.jpeg','Белый', ROUND(RAND()*(100000-5000)+5000)),
    (18,'https://cdn.mebelstol.ru/upload/preview/s/stol-60-60-dsp-white_1.jpeg','Венге'          , ROUND(RAND()*(100000-5000)+5000)),
    (18,'https://cdn.mebelstol.ru/upload/preview/s/stol-60-60-dsp-yasen_1.jpeg','Ясень'          , ROUND(RAND()*(100000-5000)+5000)),

    -- Стол Столлайн Анри
    (19,'https://cdn.mebelstol.ru/upload/preview/c/catalog_11927942021110011001_1.jpg','Мрамор белый' , ROUND(RAND()*(100000-5000)+5000)),
    (19,'https://cdn.mebelstol.ru/upload/preview/c/catalog_11927942021110011002_1.jpg','Мрамор черный', ROUND(RAND()*(100000-5000)+5000)),

    -- Стол обеденный «Брик» Чёрный
    (20,'https://svmebel.online/wp-content/uploads/2021/06/stol-brik-chyornyj-sv-mebel.jpg','Черный'    , ROUND(RAND()*(100000-5000)+5000)),
    (20,'https://svmebel.online/wp-content/uploads/2021/06/stol-brik-belyj-sv-mebel-768x549.jpg','Белый', ROUND(RAND()*(100000-5000)+5000)),

    -- Стол обеденный «СО 3»
    (21,'https://svmebel.online/wp-content/uploads/2023/02/stol-so-3-raskladnoj-belyj-ldsp-sv-mebel-2-768x549.jpg','Белый'            , ROUND(RAND()*(100000-5000)+5000)),
    (21,'https://svmebel.online/wp-content/uploads/2023/02/stol-so-3-raskladnoj-dub-zolotoj-ldsp-sv-mebel-2-768x549.jpg','Золотой зуб', ROUND(RAND()*(100000-5000)+5000)),

    -- Стол обеденный «Ультра»
    (22,'https://svmebel.online/wp-content/uploads/2022/05/stol-ultra-dub-toronto-sv-mebel.jpg','Дуб торонто.'               , ROUND(RAND()*(100000-5000)+5000)),
    (22,'https://svmebel.online/wp-content/uploads/2022/05/stol-ultra-chyornyj-matovyj-shagren-sv-mebel-768x549.jpg','Черный', ROUND(RAND()*(100000-5000)+5000)),

    -- Шкафы

    -- Модульная гостиная «Токио»
    (23,'https://svmebel.online/wp-content/uploads/2023/02/modulnaya-gostinaya-tokio-belyj-teksturnyj-sv-mebel-2.jpg','Модульная гостиная «Токио»', ROUND(RAND()*(100000-5000)+5000)),

    -- Шкаф четырёхстворчатый «Милан» Белый
    (24,'https://svmebel.online/wp-content/uploads/2023/05/shkaf-chetyrehstvorchatyj-belyj-napolnenie-milan-sv-mebel-krasnodar.jpg','Шкаф четырёхстворчатый «Милан» Белый', ROUND(RAND()*(100000-5000)+5000)),

    -- Гостиная «МГС 5»
    (25,'https://svmebel.online/wp-content/uploads/2022/03/mebel-dlya-gostinoj-mgs-5-gostinaya-belyj-czement-svetlyj.jpg','Гостиная «МГС 5»', ROUND(RAND()*(100000-5000)+5000)),

    -- Шкаф-купе корпус 1,5м "Лотос/Орфей"
    (26,'no photo','Шкаф-купе корпус 1,5м "Лотос/Орфей"', ROUND(RAND()*(100000-5000)+5000)),

    -- Шкаф-купе Лотос-1 1,7м
    (27,'https://alleyadoma.ru/upload/iblock/da4/da4e3e48aaaa56f33a9d7419a461a372.jpg','Черный', ROUND(RAND()*(100000-5000)+5000)),
    (27,'https://alleyadoma.ru/upload/iblock/62c/62cd57348dc1146cabc6d530e7dfe62a.jpg','Ясень' , ROUND(RAND()*(100000-5000)+5000)),

    -- Кровати

    -- Диван-кровать №1 Дуб Ясень Анкор
    (28,'https://svmebel.online/wp-content/uploads/2021/08/divan-krovat-%E2%84%961-yasen-ankor-sv-mebel.jpg','Белый'    , ROUND(RAND()*(100000-5000)+5000)),
    (28,'https://svmebel.online/wp-content/uploads/2021/08/divan-krovat-%E2%84%961-dub-sonoma-sv-mebel.jpg','Дуб сонома', ROUND(RAND()*(100000-5000)+5000)),

    -- ДМ-09 Кровать «Вега» 0,8 м
    (29,'https://parkmebeli.com/wp-content/uploads/2023/02/detskaya-vega-dm-09-krovat-08h186-sosna-kareliya-sv-mebel.jpg','ДМ-09 Кровать «Вега» 0,8 м', ROUND(RAND()*(100000-5000)+5000)),

    -- Кровать двуспальная 1,6 м «Токио»
    (30,'https://svmebel.online/wp-content/uploads/2023/02/krovat-tokio-belyj-teksturnyj-sv-mebel-768x549.jpg','Кровать двуспальная 1,6 м «Токио»', ROUND(RAND()*(100000-5000)+5000)),

    -- Кровать-диван с ящиками 0.9*2м «Грей» с фотопечатью
    (31,'https://svmebel.online/wp-content/uploads/2021/07/detskaya-grej-krovat-divan-s-yashhikami-czement-svetlyj-belyj-s-fotopechatyu-sv-mebel.jpg','Кровать-диван', ROUND(RAND()*(100000-5000)+5000)),

    -- Кровать 1.8 м КР-101 «Александрия»
    (32,'https://svmebel.online/wp-content/uploads/2022/05/krovat-18-m-kr-101-aleksandriya-sv-mebel.jpg','Кровать 1.8 м КР-101 «Александрия»', ROUND(RAND()*(100000-5000)+5000)),

    -- Кресла-кровати

    -- Кресло-кровать Salotti Альфа
    (33,'https://cdn.mebelstol.ru/upload/preview/a/alfa_brown_2_1.png','Коричневый'   , ROUND(RAND()*(100000-5000)+5000)),
    (33,'https://cdn.mebelstol.ru/upload/preview/a/alfa_grey_2.png','Темно-серый'     , ROUND(RAND()*(100000-5000)+5000)),
    (33,'https://cdn.mebelstol.ru/upload/preview/a/alfa_dark_blue_2.png','Темно-серый', ROUND(RAND()*(100000-5000)+5000)),

    -- Кресло-кровать Лига Диванов Сенатор 60
    (34,'https://cdn.mebelstol.ru/upload/preview/d/d07713f69f5a077e571271a5c51469ba.jpg','Коричневый', ROUND(RAND()*(100000-5000)+5000)),
    (34,'https://cdn.mebelstol.ru/upload/preview/2/222421f50a2a9cdcc7ffb8be4d855273.jpg','Зеленый'   , ROUND(RAND()*(100000-5000)+5000)),
    (34,'https://cdn.mebelstol.ru/upload/preview/f/fe249902b90b5b4a3eafb7310576706b.jpg','Бежевый'   , ROUND(RAND()*(100000-5000)+5000)),

    -- Матрасы

    -- Матрас Comforto
    (35, 'https://svmebel.online/wp-content/uploads/2023/06/matras-comforto-sono.jpg','Матрас Comforto', ROUND(RAND()*(100000-5000)+5000)),

    -- Матрас Comfo холло микс
    (36, 'https://svmebel.online/wp-content/uploads/2022/09/matras-komfo-hollo-miks-sono.jpg','Матрас Comfo холло микс', ROUND(RAND()*(100000-5000)+5000)),

    -- Матрас Norma
    (37, 'https://svmebel.online/wp-content/uploads/2022/09/matras-norma-norma-sono.jpg','Матрас Norma', ROUND(RAND()*(100000-5000)+5000)),

    -- Матрас Comfo сезон
    (38, 'https://svmebel.online/wp-content/uploads/2022/09/matras-comfo-sezon-sono.jpg','Матрас Comfo сезон', ROUND(RAND()*(100000-5000)+5000)),

    -- Матрас Extra микс
    (39, 'https://svmebel.online/wp-content/uploads/2022/09/matras-extra-miks.jpg','Матрас Extra микс', ROUND(RAND()*(100000-5000)+5000)),

    -- Пуфы

    -- Пуф «Квадратик» Венге
    (40,'https://svmebel.online/wp-content/uploads/2021/08/puf-kvadratik-santeks-venge-sv-mebel.jpg','Черный', ROUND(RAND()*(100000-5000)+5000)),
    (40,'https://svmebel.online/wp-content/uploads/2021/08/puf-kvadratik-santeks-belyj-sv-mebel.jpg','Белый' , ROUND(RAND()*(100000-5000)+5000)),

    -- Пуф «Груша»
    (41,'https://svmebel.online/wp-content/uploads/2021/08/puf-grusha-seryj-s-printom-gazeta-sv-mebel.jpg','Пуф «Груша»', ROUND(RAND()*(100000-5000)+5000)),

    -- Пуф STOOL GROUP Шарлотта с ящиком
    (42,'https://cdn.mebelstol.ru/upload/preview/p/puf-sharlotta-s-yashchikom-velyur-zelenyj_white_1_1.jpeg','Зеленый', ROUND(RAND()*(100000-5000)+5000)),
    (42,'https://cdn.mebelstol.ru/upload/preview/p/puf-sharlotta-s-yashchikom-velyur-rozovyj_white_1_1.jpeg','Розовый', ROUND(RAND()*(100000-5000)+5000)),
    (42,'https://cdn.mebelstol.ru/upload/preview/p/puf-sharlotta-s-yashchikom-velyur-seryj_white_1_1.jpeg',  'Серый'  , ROUND(RAND()*(100000-5000)+5000)),

    -- Пуфик Betel КЛАССИК
    (43,'https://cdn.mebelstol.ru/upload/preview/k/knjhvfrd.jpg','c-221'      , ROUND(RAND()*(100000-5000)+5000)),
    (43,'https://cdn.mebelstol.ru/upload/preview/k/kjihgytfds.jpg','c-121'    , ROUND(RAND()*(100000-5000)+5000)),
    (43,'https://cdn.mebelstol.ru/upload/preview/n/njniuhvutfcugy.jpg','c-332', ROUND(RAND()*(100000-5000)+5000)),

    -- Пуф Столлайн ШАРЛЬ круглый
    (44,'https://cdn.mebelstol.ru/upload/preview/c/catalog_11927942023020052010_1.jpg','Розовый', ROUND(RAND()*(100000-5000)+5000)),
    (44,'https://cdn.mebelstol.ru/upload/preview/c/catalog_11927942023020052013_1.jpg','Серый'  , ROUND(RAND()*(100000-5000)+5000)),
    (44,'https://cdn.mebelstol.ru/upload/preview/c/catalog_11927942023020052014_1.jpg','Зеленый', ROUND(RAND()*(100000-5000)+5000)),

    -- Тумбы

    -- Прикроватная тумба Наоми МН-021-02 Дуб Ниагара (Р)
    (45,'https://cdn.mebelstol.ru/upload/preview/2/25eb668d0f3c14ccdcbee66bf2e7b083_1.jpeg','Дуб ниагара', ROUND(RAND()*(100000-5000)+5000)),

    -- Тумба прикроватная Слайн-К Арго
    (46,'link','', ROUND(RAND()*(100000-5000)+5000)),

    -- Тумба Шведский Стандарт Мальта
    (47,'https://cdn.mebelstol.ru/upload/preview/2/2023-02-15_17-48-10.jpg','Белый' , ROUND(RAND()*(100000-5000)+5000)),
    (47,'https://cdn.mebelstol.ru/upload/preview/2/2023-02-15_18-55-20.jpg','Сонома', ROUND(RAND()*(100000-5000)+5000)),
    (47,'https://cdn.mebelstol.ru/upload/preview/2/2023-02-15_18-28-43.jpg','Венге' , ROUND(RAND()*(100000-5000)+5000)),

    -- Тумба выкатная с 4-мя ящиками МДК ТБ4
    (48,'https://cdn.mebelstol.ru/upload/preview/4/4_1_32.jpg','Белый' , ROUND(RAND()*(100000-5000)+5000)),
    (48,'https://cdn.mebelstol.ru/upload/preview/4/4_1_31.jpg','Сонома', ROUND(RAND()*(100000-5000)+5000)),
    (48,'https://cdn.mebelstol.ru/upload/preview/4/4_1_30.jpg','Венге' , ROUND(RAND()*(100000-5000)+5000)),

    -- Тумба Шведский Стандарт Кастор (4 ящика)
    (49,'https://cdn.mebelstol.ru/upload/preview/m/mbi-kas-10_2.jpg',          'Белый' , ROUND(RAND()*(100000-5000)+5000)),
    (49,'https://cdn.mebelstol.ru/upload/preview/k/kastor_10_sonoma_close.jpg','Сонома', ROUND(RAND()*(100000-5000)+5000)),
    (49,'https://cdn.mebelstol.ru/upload/preview/k/kastor_10_wenge_close.jpg', 'Венге' , ROUND(RAND()*(100000-5000)+5000)),

    -- Тумба BTS Тео
    (50,'https://cdn.mebelstol.ru/upload/preview/4/4_487.jpg','Крафт', ROUND(RAND()*(100000-5000)+5000)),

    -- Готовые прихожие

    -- Прихожая Ксения-2
    (51,'https://cdn.mebelstol.ru/upload/preview/1/1_768.jpg','венге/лоредо', ROUND(RAND()*(100000-5000)+5000)),

    -- Прихожая Лига
    (52,'https://cutt.ly/Gwic3CLP','дуб сонома', ROUND(RAND()*(100000-5000)+5000)),

    -- Прихожая Лира NEW
    (53,'https://mebelony.ru/images/BTS_HOME/3%D0%9F%D1%80%D0%B8%D1%85%D0%BE%D0%B6%D0%B8%D0%B5/%D0%9B%D0%B8%D1%80%D0%B0_NEW/%D0%9B%D0%B8%D1%80%D0%B0-NEW.jpg','венге/лоредо', ROUND(RAND()*(100000-5000)+5000)),

    -- Прихожая Трамп
    (54,'https://mebelony.ru/images/BTS_HOME/3%D0%9F%D1%80%D0%B8%D1%85%D0%BE%D0%B6%D0%B8%D0%B5/%D0%A2%D1%80%D0%B0%D0%BC%D0%BF/%D0%A2%D1%80%D0%B0%D0%BC%D0%BF-%D0%BF%D1%80%D0%B8%D1%85%D0%BE%D0%B6%D0%B0%D1%8F-%D0%B2%D0%B8%D0%B4-2.jpg'
    ,'крафт/бетон', ROUND(RAND()*(100000-5000)+5000)),

    -- Прихожая Сити лоредо
    (55,'https://cutt.ly/Vwic3v95','лорпедо', ROUND(RAND()*(100000-5000)+5000)),
    (55,'Это уже ссылка на cutt.ly.','венге', ROUND(RAND()*(100000-5000)+5000));


-- Добавление записей в таблицу вариантов товара
insert products_images
(product_variant_id, img_link, img_order)
values

    -- Диван Гранд велюр

    -- Шоколад
    (1,'https://cdn.mebelstol.ru/upload/files/d/divan_mebel_ars_grand_veljur_20.jpg',1),
    (1,'https://cdn.mebelstol.ru/upload/files/1/13_764.jpg',2),
    (1,'https://mebelstol.ru/upload/files/1/10_1097.jpg',3),

    -- Пудра
    (2,'https://mebelstol.ru/upload/files/d/divan_mebel_ars_grand_veljur_6_1.jpg',1),
    (2,'https://mebelstol.ru/upload/files/1/1_5468.jpg',2),
    (2,'https://mebelstol.ru/upload/files/4/4_859.jpg',3),

    -- Черный
    (3,'https://mebelstol.ru/upload/files/d/divan_mebel_ars_grand_veljur_18_1.jpg',1),

    -- Диван «Токио 2»

    (4,'https://svmebel.online/wp-content/uploads/2022/08/divan-tokio-2-pryamoj-seryj-akkordeon-vysokoelastichnyj-ppu-2.jpg',1),
    (4,'https://svmebel.online/wp-content/uploads/2022/08/divan-tokio-2-pryamoj-seryj-akkordeon-vysokoelastichnyj-ppu-1.jpg',2),

    -- Диван «Остин»

    (5,'https://svmebel.online/wp-content/uploads/2022/08/divan-ostin-uglovoj-bezhevyj-pantograf-pruzhinnyj-blok-bonnel-1.jpg',1),
    (5,'https://svmebel.online/wp-content/uploads/2022/08/divan-ostin-uglovoj-bezhevyj-pantograf-pruzhinnyj-blok-bonnel-2.jpg',2),

    -- Диван «Камелот 2»

    (6,'https://svmebel.online/wp-content/uploads/2022/08/divan-kamelot-2-pryamoj-temno-fioletovyj-pantograf-nezavisimyj-pruzhinnyj-blok-1.jpg',1),
    (6,'https://svmebel.online/wp-content/uploads/2022/08/divan-kamelot-2-pryamoj-temno-fioletovyj-pantograf-nezavisimyj-pruzhinnyj-blok-2.jpg',2),

    -- Соната диван-кровать

    -- Принт салмон
    (7,'https://skfo.silvamebel.ru/upload/resize_cache/webp/iblock/494/854_570_1/9tbodcek2qmxbd6p3h8q5668b4mcg2cn.webp',1),

    -- Микрофибра
    (8,'https://skfo.silvamebel.ru/upload/resize_cache/webp/iblock/0b7/854_570_1/y9l534pwclmk0vgoxq6ihn7rb8col1f7.webp',1),

    -- М-В Кетс.
    (9,'https://skfo.silvamebel.ru/upload/resize_cache/webp/iblock/5d9/854_570_1/m7kit3e5z1mz52m5oa9tl78cnznaye4b.webp',1),

    -- Кухня 2,0м BTS Люкс модульная

    -- Лоза
    (10,'https://cdn.mebelstol.ru/upload/files/2/2_1150.jpg',1),

    -- Прима
    (11,'https://mebelstol.ru/upload/files/3/3_860.jpg',1),

    -- Акварель
    (12,'https://mebelstol.ru/upload/files/5/5_464.jpg',1),

    -- Кухонный гарнитур Сокол ПН-04

    -- Дуб сонома.
    (13,'https://cdn.mebelstol.ru/upload/files/1/1121959.jpeg',1),
    (13,'https://cdn.mebelstol.ru/upload/files/2/2_4028.jpg',2),

    -- Белый/Венге
    (14,'https://mebelstol.ru/upload/files/1/1121958.jpeg',1),
    (14,'https://mebelstol.ru/upload/files/1/1_6053.jpg',2),

    -- Кухня 2,0м BTS Тифани
    (15,'https://cdn.mebelstol.ru/upload/files/1/1_2888.jpg',1),

    -- Кухня 2,0м BTS Скарлетт
    (16,'https://cdn.mebelstol.ru/upload/files/1/1_67.png',1),

    -- Кухня BTS Персик 1,8м
    (17,'https://cdn.mebelstol.ru/upload/files/1/1_2739.jpg',1),
    (17,'https://cdn.mebelstol.ru/upload/files/2/2_1147.jpg',2),

    -- Обеденная группа Sheffilton SHT-DS233
    (18,'https://cdn.mebelstol.ru/upload/files/2/223064.jpg',1),
    (18,'https://cdn.mebelstol.ru/upload/files/2/223064_1.jpeg',2),
    (18,'https://cdn.mebelstol.ru/upload/files/2/223064_10.jpeg',3),

    -- Стол со стульями Sheffilton SHT-DS81
    (19,'https://cdn.mebelstol.ru/upload/files/1/153818_8.jpeg',1),
    (19,'https://mebelstol.ru/',2),
    (19,'https://cdn.mebelstol.ru/upload/files/1/153818_5.jpeg',3),

    -- Обеденная группа Sheffilton SHT-DS236
    (20,'https://cdn.mebelstol.ru/upload/files/2/223274.jpg',1),
    (20,'https://cdn.mebelstol.ru/upload/files/2/223274_1.jpeg',2),
    (20,'https://cdn.mebelstol.ru/upload/files/2/223274_1.jpg',3);

-- Добавление записей в таблицу стоимостей вариантов товаров
insert products_prices
(product_variant_id, price)
values
    (1, 35490),
    (2, 35490),
    (3, 36500),
    (4, 34000),
    (4, 34000),
    (5, 34000),
    (6, 34000),
    (7, 45000),
    (8, 45000),
    (9, 47000),
    (10,22000),
    (11,22000),
    (12,22000),
    (13,22000),
    (14,22000),
    (15,22000),
    (16,ROUND(RAND()*(100000-5000)+5000)),
    (17,ROUND(RAND()*(100000-5000)+5000)),
    (18,ROUND(RAND()*(100000-5000)+5000)),
    (19,ROUND(RAND()*(100000-5000)+5000)),
    (20,ROUND(RAND()*(100000-5000)+5000)),
    (21,ROUND(RAND()*(100000-5000)+5000)),
    (22,ROUND(RAND()*(100000-5000)+5000)),
    (23,ROUND(RAND()*(100000-5000)+5000)),
    (24,ROUND(RAND()*(100000-5000)+5000)),
    (25,ROUND(RAND()*(100000-5000)+5000)),
    (26,ROUND(RAND()*(100000-5000)+5000)),
    (27,ROUND(RAND()*(100000-5000)+5000)),
    (28,ROUND(RAND()*(100000-5000)+5000)),
    (29,ROUND(RAND()*(100000-5000)+5000)),
    (30,ROUND(RAND()*(100000-5000)+5000)),
    (31,ROUND(RAND()*(100000-5000)+5000)),
    (32,ROUND(RAND()*(100000-5000)+5000)),
    (33,ROUND(RAND()*(100000-5000)+5000)),
    (34,ROUND(RAND()*(100000-5000)+5000)),
    (35,ROUND(RAND()*(100000-5000)+5000)),
    (36,ROUND(RAND()*(100000-5000)+5000)),
    (37,ROUND(RAND()*(100000-5000)+5000)),
    (38,ROUND(RAND()*(100000-5000)+5000)),
    (39,ROUND(RAND()*(100000-5000)+5000)),
    (40,ROUND(RAND()*(100000-5000)+5000)),
    (41,ROUND(RAND()*(100000-5000)+5000)),
    (42,ROUND(RAND()*(100000-5000)+5000)),
    (43,ROUND(RAND()*(100000-5000)+5000)),
    (44,ROUND(RAND()*(100000-5000)+5000)),
    (45,ROUND(RAND()*(100000-5000)+5000)),
    (46,ROUND(RAND()*(100000-5000)+5000)),
    (47,ROUND(RAND()*(100000-5000)+5000)),
    (48,ROUND(RAND()*(100000-5000)+5000)),
    (49,ROUND(RAND()*(100000-5000)+5000)),
    (50,ROUND(RAND()*(100000-5000)+5000)),
    (51,ROUND(RAND()*(100000-5000)+5000)),
    (52,ROUND(RAND()*(100000-5000)+5000)),
    (53,ROUND(RAND()*(100000-5000)+5000)),
    (54,ROUND(RAND()*(100000-5000)+5000)),
    (55,ROUND(RAND()*(100000-5000)+5000)),
    (56,ROUND(RAND()*(100000-5000)+5000)),
    (57,ROUND(RAND()*(100000-5000)+5000)),
    (58,ROUND(RAND()*(100000-5000)+5000)),
    (59,ROUND(RAND()*(100000-5000)+5000)),
    (60,ROUND(RAND()*(100000-5000)+5000)),
    (61,ROUND(RAND()*(100000-5000)+5000)),
    (62,ROUND(RAND()*(100000-5000)+5000)),
    (63,ROUND(RAND()*(100000-5000)+5000)),
    (64,ROUND(RAND()*(100000-5000)+5000)),
    (65,ROUND(RAND()*(100000-5000)+5000)),
    (66,ROUND(RAND()*(100000-5000)+5000)),
    (67,ROUND(RAND()*(100000-5000)+5000)),
    (68,ROUND(RAND()*(100000-5000)+5000)),
    (69,ROUND(RAND()*(100000-5000)+5000)),
    (70,ROUND(RAND()*(100000-5000)+5000)),
    (71,ROUND(RAND()*(100000-5000)+5000)),
    (72,ROUND(RAND()*(100000-5000)+5000)),
    (73,ROUND(RAND()*(100000-5000)+5000)),
    (74,ROUND(RAND()*(100000-5000)+5000)),
    (75,ROUND(RAND()*(100000-5000)+5000)),
    (76,ROUND(RAND()*(100000-5000)+5000)),
    (77,ROUND(RAND()*(100000-5000)+5000)),
    (78,ROUND(RAND()*(100000-5000)+5000)),
    (79,ROUND(RAND()*(100000-5000)+5000)),
    (80,ROUND(RAND()*(100000-5000)+5000)),
    (81,ROUND(RAND()*(100000-5000)+5000)),
    (82,ROUND(RAND()*(100000-5000)+5000)),
    (83,ROUND(RAND()*(100000-5000)+5000)),
    (84,ROUND(RAND()*(100000-5000)+5000)),
    (85,ROUND(RAND()*(100000-5000)+5000)),
    (86,ROUND(RAND()*(100000-5000)+5000)),
    (87,ROUND(RAND()*(100000-5000)+5000)),
    (88,ROUND(RAND()*(100000-5000)+5000)),
    (89,ROUND(RAND()*(100000-5000)+5000)),
    (90,ROUND(RAND()*(100000-5000)+5000)),
    (91,ROUND(RAND()*(100000-5000)+5000)),
    (92,ROUND(RAND()*(100000-5000)+5000)),
    (93,ROUND(RAND()*(100000-5000)+5000));

-- Добавление записей в таблицу состояний заказов
insert order_states
(order_state)
values
    ('В ожидании платежа'),
    ('Связались с клиентом'),
    ('Отправлен'),
    ('Отменён'),
    ('Выполнен');

-- Добавление записей в таблицу клиентов
insert customers
(surname, 'name', patronymic, phone_number, email)
values
    ('Инна',     'Лосева',       'Степановна'   , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user1@gmail.com'),
    ('Анна',     'Михайлович',   'Валентиновна' , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user2@gmail.com'),
    ('Марина',   'Пелых',        'Ульяновна'    , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user3@gmail.com'),
    ('Владислав','Пономаренко','Дмитриевич'     , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user4@gmail.com'),
    ('Любовь',   'Хавалджи',   'Амировна'       , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user5@gmail.com'),
    ('Ирина',    'Пархоменко', 'Владимировна'   , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user6@gmail.com'),
    ('Алина',    'Демидова',   'Александровна'  , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user7@gmail.com'),
    ('Тамара',   'Лапотникова',  'Оскаровна'    , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user8@gmail.com'),
    ('Олег',     'Чмыхало',    'Тарасович'      , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user9@gmail.com'),
    ('Степан',   'Князьков', 	 'Сидорович'    , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user10@gmail.com'),
    ('Наталья',  'Игнатенко',	 'Павловна'     , 79490000000000 + Round(RAND()*(20000-5000)+5000,0),'user11@gmail.com');

-- Добавление записей в таблицу ролей пользователей
insert user_roles
(role)
values
    ('Администратор'),
    ('Редактор'),
    ('Покупатель');

-- Добавление записей в таблицу пользователей
insert users
(login, email, role_id)
values
    ('admin','admin@gmail.com',1          ),
    ('moderator1','moderator1@gmail.com',2),
    ('user1','user1@gmail.com',3          ),
    ('user2','user2@gmail.com',3          ),
    ('user3','user3@gmail.com',3          );

-- Добавление записей в таблицу паролей пользователей
insert categories_views
(visitor_id, category_id, count)
values
    (:visitor, :category, :count);

insert users
(login, email, role_id)
values
    ();

-- Добавление заказов
insert orders
(order_state_id, customer_id, code)
values
    (1, 1, RAND()*(10000000000-10000000)+10000000),
    (1, 2, RAND()*(10000000000-10000000)+10000000),
    (1, 3, RAND()*(10000000000-10000000)+10000000),
    (3, 4, RAND()*(10000000000-10000000)+10000000),
    (3, 5, RAND()*(10000000000-10000000)+10000000),
    (2, 5, RAND()*(10000000000-10000000)+10000000),
    (5, 5, RAND()*(10000000000-10000000)+10000000),
    (5, 6, RAND()*(10000000000-10000000)+10000000),
    (4, 6, RAND()*(10000000000-10000000)+10000000),
    (1, 7, RAND()*(10000000000-10000000)+10000000),
    (1, 8, RAND()*(10000000000-10000000)+10000000),
    (4, 9, RAND()*(10000000000-10000000)+10000000),
    (1, 10,RAND()*(10000000000-10000000)+10000000),
    (2, 11,RAND()*(10000000000-10000000)+10000000);

-- Добавление записей в таблицу корзин
insert baskets
(user_id)
values
    (RAND()*(5-3)+3),
    (RAND()*(5-3)+3),
    (RAND()*(5-3)+3),
    (RAND()*(5-3)+3);

-- Добавление содержимого корзины - список вариантов товаров и их количество

insert baskets_products_variants
(product_variant_id, basket_id, products_count)
values
    (RAND()*(188-1)+1, RAND()*(6-1)+1, 1),
    (RAND()*(188-1)+1, RAND()*(6-1)+1, 1),
    (RAND()*(188-1)+1, RAND()*(6-1)+1, 1),
    (RAND()*(188-1)+1, 1, 1),
    (RAND()*(188-1)+1, 2, 1),
    (RAND()*(188-1)+1, 2, 1),
    (RAND()*(188-1)+1, 2, 1),
    (RAND()*(188-1)+1, 2, 1),
    (RAND()*(188-1)+1, 3, 1),
    (RAND()*(188-1)+1, 3, 1),
    (RAND()*(188-1)+1, 3, 1),
    (RAND()*(188-1)+1, 3, 1),
    (RAND()*(188-1)+1, 4, 1),
    (RAND()*(188-1)+1, 4, 1),
    (RAND()*(188-1)+1, 4, 1),
    (RAND()*(188-1)+1, 5, 1),
    (RAND()*(188-1)+1, 5, 1),
    (RAND()*(188-1)+1, 5, 1),
    (RAND()*(188-1)+1, 6, 1),
    (RAND()*(188-1)+1, 6, 1);

-- Добавить тестовых значений в таблицу визитов по дням
insert daily_visits
(date, count)
values
    ('2023-12-26',RAND()*(50-3)+3),
    ('2023-12-27',RAND()*(50-3)+3),
    ('2023-12-28',RAND()*(50-3)+3),
    ('2023-12-29',RAND()*(50-3)+3),
    ('2023-12-30',RAND()*(50-3)+3),
    ('2023-12-31',RAND()*(50-3)+3),
    ('2024-01-02',RAND()*(50-3)+3),
    ('2024-01-03',RAND()*(50-3)+3),
    ('2024-01-04',RAND()*(50-3)+3),
    ('2024-01-05',RAND()*(50-3)+3),
    ('2024-01-06',RAND()*(50-3)+3),
    ('2024-01-07',RAND()*(50-3)+3),
    ('2024-01-08',RAND()*(50-3)+3),
    ('2024-01-09',RAND()*(50-3)+3),
    ('2024-01-10',RAND()*(50-3)+3),
    ('2024-01-11',RAND()*(50-3)+3),
    ('2024-01-12',RAND()*(50-3)+3),
    ('2024-01-13',RAND()*(50-3)+3),
    ('2024-01-14',RAND()*(50-3)+3),
    ('2024-01-15',RAND()*(50-3)+3),
    ('2024-01-16',RAND()*(50-3)+3),
    ('2024-01-17',RAND()*(50-3)+3),
    ('2024-01-18',RAND()*(50-3)+3),
    ('2024-01-19',RAND()*(50-3)+3),
    ('2024-01-20',RAND()*(50-3)+3),
    ('2024-01-21',RAND()*(50-3)+3),
    ('2024-01-22',RAND()*(50-3)+3),
    ('2024-01-23',RAND()*(50-3)+3),
    ('2024-01-24',RAND()*(50-3)+3),
    ('2024-01-25',RAND()*(50-3)+3),
    ('2024-01-26',RAND()*(50-3)+3),
    ('2024-01-27',RAND()*(50-3)+3),
    ('2024-01-28',RAND()*(50-3)+3),
    ('2024-01-29',RAND()*(50-3)+3),
    ('2024-01-30',RAND()*(50-3)+3),
    ('2024-01-31',RAND()*(50-3)+3);